{
 "elementList": [
  {
   "propertyCode": "33065929",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/a1/fe/96/230328798.jpg",
   "externalReference": "LOU-EMP-211966",
   "numPhotos": 27,
   "floor": "6",
   "price": 327500.0,
   "propertyType": "flat",
   "operation": "sale",
   "size": 105.0,
   "rooms": 3,
   "bathrooms": 2,
   "address": "Santa Marta do Pinhal",
   "province": "Setúbal",
   "municipality": "Corroios",
   "district": "Santa Marta do Pinhal",
   "country": "pt",
   "latitude": 38.6269578,
   "longitude": -9.1500964,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065929/",
   "distance": "10605",
   "description": "Excelente apartamento T3 pronto a habitar, situado numa zona com excelentes acessos as principais vias, tais como a A2, A 33 e com transportes com ligação a estação da Fertagus em Corroios bem como ao metro de superfície, e também dos acessos as praias da Costa da Caparica e Fonte da Telha.   Esta inserido numa zona com espaços verdes e perto do mar.     O apartamento possui Hall, sala e quartos com pavimento estratificado em madeira. Cozinha totalmente equipada com forno, micro-ondas, placa de indução, exaustor, combinado, máquina de lavar roupa e louça, lava loiça em inox encastrado na bancada. Casa de banho com pavimento em grés cerâmico polido retificado, louças sanitárias suspensas, móveis suspensos com espelhos, torneiras com design moderno e pintura com tinta antifúngica.   Tetos falsos com lâmpadas LED embutidas. Instalação de ar condicionado na sala e quarto.     Santa Marta do Pinhal é uma localidade portuguesa da freguesia de Corroios, concelho do Seixal, distrito de Setúbal.   Antigo local ocupado por um extenso pinhal, é hoje uma das localidades mais urbanizadas do concelho do Seixal em grande desenvolvimento.   Santa Marta do Pinhal é limitada a leste pelo município do Barreiro e Seixal, a sul por Sesimbra, a norte por Almada e pelo estuário do Tejo, através do qual tem ligação a Lisboa.   As principais atividades económicas são o comércio, serviços e algumas indústrias alimentares, especialmente no ramo da Pastelaria.   Existem 2 escolas básicas com o 1º ciclo, e 1 escola com 2º e 3º ciclos.   É rodeada de excelentes acessos a Lisboa e as praias, bem como da estação de comboios da Fertagus de Corroios, podendo assim deslocar-se de maneira mais rápida para Lisboa pela Ponte 25 de Abril.     NOTA: FOTOS MERAMENTE ILUSTRATIVAS     O imóvel e constituído por COZINHA com 10,65 mt2, SALA com 20,85 mt2, WC social com 4,80mt2, QUARTO 1 com 9,20 mt2, QUARTO 2 com 13mt2, SUITE com 10,55 mt2 com WC com 2,20mt2, VARANDA dos quartos com 5,75 mt2, VARANDA da sala e cozinha com 7mt2.     Trata-se de um 6º andar com 2 varandas, parqueamento e arrecadação.     Temos uma equipa pronta a ajudar em todo o processo relativo a compra do imóvel, analise de credito, simulações, departamento jurídico e outros serviços, fazemos o acompanhamento de todo o processo.     Não hesite em me contactar para mais informações.",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "hasLift": true,
   "priceByArea": 3119.0,
   "detailedType": {
    "typology": "flat"
   },
   "suggestedTexts": {
    "subtitle": "Corroios, Seixal",
    "title": "Apartamento"
   },
   "hasPlan": true,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065960",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/e6/b7/55/230328557.jpg",
   "externalReference": "ATL3474",
   "numPhotos": 27,
   "floor": "2",
   "price": 377500.0,
   "propertyType": "flat",
   "operation": "sale",
   "size": 102.0,
   "rooms": 2,
   "bathrooms": 2,
   "address": "Colinas do Cruzeiro",
   "province": "Lisboa",
   "municipality": "Odivelas",
   "district": "Colinas do Cruzeiro",
   "country": "pt",
   "latitude": 38.7906387,
   "longitude": -9.1912107,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065960/",
   "distance": "8854",
   "description": "Excelente apartamento T2 localizado na Rua Mário Moreira, na Urbanização Colinas do Cruzeiro, em Odivelas, com duas generosas varandas, que oferecem uma vista desafogada e uma boa exposição solar, proporcionando um ambiente agradável e luminoso. O apartamento é composto pelas seguintes divisões e áreas: um hall/circulação com 8,90 m², uma sala espaçosa com 24,50 m², uma cozinha funcional com 12,90 m², um quarto com 12,85 m², uma casa de banho social com 3,80 m², uma suite com 16,00 m² e uma casa de banho privativa com 5,90 m². Além disso, o apartamento possui duas varandas, sendo a primeira com churrasqueira, perfeita para desfrutar de refeições ao ar livre, e a segunda com 11,00 m². Há também uma arrecadação no piso -2 com 3,50 m² e um parqueamento de fácil acesso para duas viaturas com 25,00 m². Este apartamento está equipado com eletrodomésticos Ariston, sistema de aspiração central, ar-condicionado LG, som ambiente e estores elétricos. Além disso, o apartamento encontra-se em excelente estado de conservação. Não perca a oportunidade de morar nm imóvel com todas as comodidades e numa localização privilegiada. Entre em contato agora mesmo para agendar uma visita e conhecer pessoalmente todas as vantagens deste apartamento. Informação adicional:  - Ano: 2007  - Certificado Energético: B-  - Valor mensal do condomínio: 48.",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "hasLift": true,
   "parkingSpace": {
    "hasParkingSpace": true,
    "isParkingSpaceIncludedInPrice": true
   },
   "priceByArea": 3701.0,
   "detailedType": {
    "typology": "flat"
   },
   "suggestedTexts": {
    "subtitle": "Odivelas",
    "title": "Apartamento"
   },
   "hasPlan": false,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065945",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/5d/ba/b2/230328294.jpg",
   "externalReference": "208-2023",
   "numPhotos": 53,
   "floor": "1",
   "price": 237500.0,
   "propertyType": "flat",
   "operation": "sale",
   "size": 113.0,
   "rooms": 2,
   "bathrooms": 1,
   "address": "Pinhal Novo",
   "province": "Setúbal",
   "municipality": "Pinhal Novo",
   "country": "pt",
   "latitude": 38.6382152,
   "longitude": -8.9062025,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065945/",
   "distance": "22287",
   "description": "Fantástico Apartamento, na Urbanização Vila Serena, para quem procura viver numa zona calma e bastante privilegiada.  É um Apartamento de 2019 com elevador, composto por sala com uma área bastante generosa e AC. Com muita luz natural, podendo disfrutar do seu tempo de lazer ao final da tarde numa varanda espaçosa. Cozinha toda equipada, também com varanda, e neste apartamento temos a particularidade da zona de lazer ser separada pela social. Os dois quartos tem roupeiros embutidos, e ar condicionado, wc completa. E sótão no ultimo piso. Proximidade a Serviços, Piscinas Municipais, Escolas e Colégios (Ensino Publico e Privado), Centro de Saúde Local, Comércio Local e Comércio Grandes Superfícies bem como aos Principais Acessos Rodoferroviários a Setúbal, Montijo e Lisboa (A2, A33, A12 e Estações CP-Fertagus). Não perca esta oportunidade e marque já a sua visita...",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "hasLift": true,
   "priceByArea": 2102.0,
   "detailedType": {
    "typology": "flat"
   },
   "suggestedTexts": {
    "subtitle": "Pinhal Novo, Palmela",
    "title": "Apartamento"
   },
   "hasPlan": false,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065897",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/1b/d4/6b/230327951.jpg",
   "externalReference": "58637",
   "numPhotos": 64,
   "price": 940000.0,
   "propertyType": "chalet",
   "operation": "sale",
   "size": 763.0,
   "rooms": 4,
   "bathrooms": 4,
   "address": "Rua João Gonçalves s/n",
   "province": "Lisboa",
   "municipality": "Arruda dos Vinhos",
   "country": "pt",
   "latitude": 38.9974402,
   "longitude": -9.070908,
   "showAddress": true,
   "url": "https://www.idealista.pt/imovel/33065897/",
   "distance": "31198",
   "description": "Excelente moradia T4 situada nas Corredoras em Arruda dos Vinhos numa zona muito calma e bem situada. Esta excelente moradia onde estamos na cidade e ao mesmo tempo no campo. com acabamentos de topo tem no seu interior e exterior, encontra-se perto de todo o tipo de serviços. No rés do chão tem uma cozinha totalmente equipada com zona de lavandaria, sala de estar com lareira e muita luz natural, dispomos ainda de um WC, um quarto e uma dispensa para arrumos. Temos acesso ao jardim onde há uma piscina um jacuzzi e uma churrasqueira. No piso 1 temos 3 suites todas elas com WC privativo, roupeiros embutidos e uma vista deslumbrante sobre o campo. Esta excelente moradia está equipada com painéis solares, piscina de água salgada aquecida, jacuzzi, no jardim na área envolvente temos arvores de fruto e na parte frontal desta moradia temos uma garagem fechada para duas viaturas com sistema de carregamento para veículos elétricos. Possibilidade de a moradia ficar TOTALMENTE mobilada. Venha conhecer a sua futura casa!  marque já a sua visita.",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "priceByArea": 1232.0,
   "detailedType": {
    "typology": "chalet"
   },
   "suggestedTexts": {
    "subtitle": "Arruda dos Vinhos",
    "title": "Moradia na Rua João Gonçalves s/n"
   },
   "hasPlan": true,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065878",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/eb/ec/ac/230327525.jpg",
   "numPhotos": 31,
   "price": 760000.0,
   "propertyType": "chalet",
   "operation": "sale",
   "size": 221.0,
   "rooms": 4,
   "bathrooms": 2,
   "address": "Alvalade",
   "province": "Lisboa",
   "municipality": "Alvalade",
   "district": "Alvalade",
   "country": "pt",
   "latitude": 38.749075,
   "longitude": -9.1383832,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065878/",
   "distance": "3014",
   "description": "Oportunidade Única em Alvalade, Lisboa - Moradia com Jardim para Remodelação Esta é a sua oportunidade de criar o lar dos seus sonhos em uma das áreas mais desejadas de Lisboa, Alvalade. Esta moradia espaçosa, com um amplo jardim, aguarda por sua visão e criatividade para se tornar a residência perfeita. Com a sua localização privilegiada, espaço ao ar livre e potencial ilimitado, esta propriedade é uma verdadeira tela em branco esperando para ser transformada. Características Principais: Situada em Alvalade, uma das zonas mais procuradas de Lisboa, com acesso fácil a comércio, escolas, parques e transportes públicos. Esta é uma oportunidade rara de criar uma casa personalizada de acordo com suas preferências. Desfrute de um jardim privado, perfeito para relaxar, entreter e desfrutar do clima de Lisboa. O espaço interior oferece um layout flexível que permite a criação de diferentes ambientes e áreas de convívio. Ao remodelar esta moradia, você estará investindo em uma propriedade que tem grande potencial de valorização. Alvalade é conhecida por sua qualidade de vida, com ruas arborizadas, comércio local diversificado e um ambiente acolhedor. Esta moradia oferece a rara combinação de uma localização premium e a oportunidade de personalização total. Se você procura uma moradia com jardim em Lisboa para remodelação e deseja criar a casa dos seus sonhos, não perca esta oportunidade. Entre em contato para agendar uma visita e comece a transformar esta propriedade em uma residência que reflete o seu estilo e necessidades.",
   "hasVideo": false,
   "status": "renew",
   "newDevelopment": false,
   "priceByArea": 3439.0,
   "detailedType": {
    "typology": "chalet",
    "subTypology": "terracedHouse"
   },
   "suggestedTexts": {
    "subtitle": "Alvalade, Lisboa",
    "title": "Moradia em banda"
   },
   "hasPlan": true,
   "has3DTour": true,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065862",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/82/61/44/230327119.jpg",
   "externalReference": "514B/2023AL",
   "numPhotos": 56,
   "price": 4000000.0,
   "propertyType": "chalet",
   "operation": "sale",
   "size": 439.0,
   "rooms": 5,
   "bathrooms": 5,
   "address": "Jardins da Parede",
   "province": "Lisboa",
   "municipality": "Carcavelos e Parede",
   "district": "Jardins da Parede",
   "country": "pt",
   "latitude": 38.6980696,
   "longitude": -9.3633295,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065862/",
   "distance": "19603",
   "description": "Excelente moradia V5 isolada, com design contemporâneo, totalmente renovada;  com 3 pisos e terraço, amplas áreas e ótimos acabamentos e belíssima vista de mar  do Alto da Parede. Possui ampla piscina, deck, jardins e cozinha gourmet, totalmente equipada, para  refeições ao ar livre. É assim composta: Piso 0: ampla sala com vista panorâmica e terraço, casa de banho social, sala de  refeições com ligação a cozinha (com portas de correr para fechar por completo); Piso 1: master suite com walking closet e varanda, 1 suite+1 quarto, todos com  roupeiros, grandes janelas e vista mar ou piscina. Acesso ao terraço com vista frontal de mar até Cascais. Piso -1: suite, com acesso ao spa (com jacuzzi, sauna e banho turco), terraço, e  outra divisão (que poderá ser quarto ou escritório). Acesso a garagem box para 3  veículos com entradas independentes e portão com abertura por controle remoto. A moradia possui pé direito alto, grandes janelas permitindo a entrada de muita luminosidade em todas as suas divisões. Beneficia-se com painéis solares novos, aquecimento central, ar condicionado, vídeo porteiro, porta de segurança. Venha conhecer!",
   "hasVideo": true,
   "status": "good",
   "newDevelopment": false,
   "parkingSpace": {
    "hasParkingSpace": true,
    "isParkingSpaceIncludedInPrice": true
   },
   "priceByArea": 9112.0,
   "detailedType": {
    "typology": "chalet",
    "subTypology": "independantHouse"
   },
   "suggestedTexts": {
    "subtitle": "Carcavelos e Parede, Cascais",
    "title": "Moradia independente"
   },
   "hasPlan": true,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "labels": [
    {
     "name": "seaViewsType",
     "text": "Vista mar"
    },
    {
     "name": "luxuryType",
     "text": "De luxo"
    },
    {
     "name": "villaType",
     "text": "Villa"
    }
   ],
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065881",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/af/ab/b4/230327275.jpg",
   "externalReference": "109048",
   "numPhotos": 26,
   "price": 520000.0,
   "propertyType": "chalet",
   "operation": "sale",
   "size": 161.0,
   "rooms": 3,
   "bathrooms": 3,
   "address": "Castelo (Sesimbra)",
   "province": "Setúbal",
   "municipality": "Castelo (Sesimbra)",
   "country": "pt",
   "latitude": 38.4929716,
   "longitude": -9.1721873,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065881/",
   "distance": "25621",
   "description": "Tenho o prazer de apresentar esta bela moradia de três quartos e três casas de banho na sua fase final de construção localizada na Lagoa de Albufeira, Sesimbra. De facto, a data prevista de conclusão é a primavera de 2024.  Esta moradia faz parte de um projeto de desenvolvimento na zona da Lagoa, que, quando concluído, será deslumbrante pela modernidade e unidade das casas. Todas as casas estão ligadas pelas garagens, o que significa que nunca está ligado à casa dos seus vizinhos por uma área de estar. Esta casa em particular, devido à sua localização, não tem vis-à-vis à frente ou atrás! Construída por um dos construtores mais conceituados da zona, a moradia apresenta os mais elevados padrões de construção, atenção aos pormenores e é tão eco-responsável quanto possível com a sua classificação de certificado energético A+.  A distribuição das divisões é a seguinte:  No rés do chão, encontrará  - Uma grande sala de estar/jantar de 38m2  - Uma cozinha totalmente equipada em plano aberto com 10m2  - Uma suite deslumbrante com um quarto de 19m2 e uma casa de banho de 5m2  - Uma casa de banho social de 3m2  - Jardins à frente (35m2) e atrás (42m2) incluindo uma piscina de 20m2.  - E o efeito WOW na sala principal do teto de 6m2 que requer um lustre fantástico para realçar o efeito.  - Garagem 38m2  No piso superior, encontrará  - Dois quartos de 14m2 cada  - Uma casa de banho de 5m2  - A mezzanine de 25m2 que pode ser transformada numa sala de estar, um quarto extra, um escritório, etc.  - Varandas à frente e atrás  - O espaço por cima da garagem pode ser transformado num espaço verde extra e utilizado como terraço  Em toda a casa, terá  - Janelas com vidros duplos  - Estores eléctricos  - Ar condicionado/aquecimento split reversível  - Chão aquecido nas casas de banho  - Cobertura de isolamento total em toda a casa (painéis de isolamento de 8 cm)  - Bomba de calor para água  Esta é uma casa chave na mão, tudo o que precisa de fazer é mudar-se!  A Lagoa de Albufeira, Sesimbra é um refúgio de paz. Localizada a dois quilómetros da praia, e a dois quilómetros da aldeia mais próxima de Alfarim onde pode encontrar alguns dos melhores restaurantes locais da zona, farmácia, veterinário, cafés e pequenas lojas, fica também a 15 minutos da praia de Sesimbra, a 10 minutos de todos os principais supermercados e a 40 minutos de Lisboa e do aeroporto. Fica também a 30 minutos de Setúbal e das deslumbrantes praias da reserva natural da Arrábida. É verdadeiramente um sítio glorioso para viver ou ter uma casa de férias.  Para mais informações, por favor contacte-me através dos seguintes contactos: (telefone ou Whatsapp) ref: 109048.",
   "hasVideo": true,
   "status": "good",
   "newDevelopment": false,
   "parkingSpace": {
    "hasParkingSpace": true,
    "isParkingSpaceIncludedInPrice": true
   },
   "priceByArea": 3230.0,
   "detailedType": {
    "typology": "chalet"
   },
   "suggestedTexts": {
    "subtitle": "Castelo (Sesimbra), Sesimbra",
    "title": "Moradia"
   },
   "hasPlan": false,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065849",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/70/d4/15/230326991.jpg",
   "numPhotos": 31,
   "price": 490000.0,
   "propertyType": "chalet",
   "operation": "sale",
   "size": 203.0,
   "rooms": 3,
   "bathrooms": 4,
   "address": "Santo Estevão",
   "province": "Santarém",
   "municipality": "Santo Estevão",
   "country": "pt",
   "latitude": 38.8814898,
   "longitude": -8.7161337,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065849/",
   "distance": "40746",
   "description": "Moradia Espetacular na Herdade da Aroeira, Santo Estevão Bem-vindo ao seu oásis de tranquilidade na Herdade da Aroeira, em Santo Estevão. Esta incrível moradia de 203 m² está situada em um lote de terreno generoso de 1015 m² e faz parte de um condomínio privado com segurança 24 horas. Este é o lar perfeito para quem procura uma combinação única de conforto, lazer e natureza. Características Principais: Espaço e Conforto: Uma moradia térrea com uma espaçosa sala de estar em open space e uma cozinha totalmente equipada, proporcionando um ambiente perfeito para o convívio. 4 Quartos com Roupeiros: Todos os quartos são bem iluminados e dispõem de amplos roupeiros. 3 Casas de Banho: Para atender às necessidades da família e dos hóspedes. Estores Elétricos: Conveniência e privacidade com um toque. Painéis Solares: Aquecimento de águas de forma ecológica. Produção de Energia: Painéis solares para geração de energia sustentável. Ar Condicionado: Conforto em todas as estações. Jardim Privado com Piscina: Um retiro ao ar livre com uma piscina convidativa. Parqueamento para Dois Carros: Espaço conveniente para sua família e visitantes. Comodidades do Condomínio: Campo de Golf: Com um clube exclusivo para os amantes do golfe o Santo Estêvão Golf com 18 buracos e 10 minutos do campo de golfe Ribagolfe Oaks com 32 buracos. Caminhos Pedestres: Para relaxantes passeios ao ar livre. Barragem: Um local pitoresco para momentos tranquilos. Campo de Ténis: Para os amantes deste desporto. Centro Hípico: Ideal para os entusiastas de cavalos. Esta propriedade é um verdadeiro paraíso para quem valoriza a qualidade de vida. Localizada na prestigiada Herdade da Aroeira, você estará a poucos minutos de campos de golfe de renome, escolas de voo e a charmosa Vila de Santo Estevão. Além disso, está convenientemente a apenas 50 minutos do centro de Lisboa. Agende uma visita hoje e descubra como esta moradia pode se tornar o seu refúgio de sonho.",
   "hasVideo": true,
   "status": "good",
   "newDevelopment": false,
   "parkingSpace": {
    "hasParkingSpace": true,
    "isParkingSpaceIncludedInPrice": true
   },
   "priceByArea": 2414.0,
   "detailedType": {
    "typology": "chalet",
    "subTypology": "independantHouse"
   },
   "suggestedTexts": {
    "subtitle": "Santo Estevão, Benavente",
    "title": "Moradia independente"
   },
   "hasPlan": true,
   "has3DTour": true,
   "has360": false,
   "hasStaging": false,
   "labels": [
    {
     "name": "moradiaTerreaType",
     "text": "Moradia térrea"
    }
   ],
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065870",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/94/7d/b4/230327003.jpg",
   "externalReference": "A060",
   "numPhotos": 14,
   "floor": "bj",
   "price": 139000.0,
   "propertyType": "studio",
   "operation": "sale",
   "size": 20.0,
   "rooms": 0,
   "bathrooms": 1,
   "address": "Rua de Marcos Marreiros",
   "province": "Lisboa",
   "municipality": "Misericórdia",
   "district": "Santa Catarina",
   "country": "pt",
   "latitude": 38.7097698,
   "longitude": -9.1485804,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065870/",
   "distance": "1570",
   "description": "Excelente T0, localizado em zona histórica e muito central. Composto por 1 sala ampla, 1 cozinha e uma casa de banho. Apartamento para remodelar a seu gosto. Inserido em prédio pequeno de traça antiga em ótimo estado. A sua localização é perfeita quer para habitação quer para rentabilizar no mercado de arrendamento. Situado na freguesia da Misericórdia, coração da cidade de Lisboa a poucos minutos a pé do Chiado, Cais do Sodré, Elevador da Bica, Miradouro de Santa Catarina assim como do Metro e do Comboio. Não perca a oportunidade e venha conhecer! **** Excellent T0, located in a historic and very central area. Comprising 1 large living room, 1 kitchen and a bathroom. Apartment to remodel to your liking. Inserted in a small old building in excellent condition. Its location is perfect both for housing and for making money on the rental market. Located in the parish of Misericórdia, heart of the city of Lisbon, just a few minutes walk from Chiado, Cais do Sodré, Elevador da Bica, Miradouro de Santa Catarina as well as the Metro and Train. Don't miss the opportunity, contact us!",
   "hasVideo": false,
   "status": "renew",
   "newDevelopment": false,
   "hasLift": false,
   "priceByArea": 6950.0,
   "detailedType": {
    "typology": "flat",
    "subTypology": "studio"
   },
   "suggestedTexts": {
    "subtitle": "Misericórdia, Lisboa",
    "title": "T0 na Rua de Marcos Marreiros"
   },
   "hasPlan": true,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065828",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/77/df/e9/230326751.jpg",
   "numPhotos": 37,
   "floor": "4",
   "price": 880000.0,
   "propertyType": "flat",
   "operation": "sale",
   "size": 130.0,
   "rooms": 3,
   "bathrooms": 2,
   "address": "Príncipe Real - São Bento",
   "province": "Lisboa",
   "municipality": "Misericórdia",
   "district": "Príncipe Real - São Bento",
   "country": "pt",
   "latitude": 38.7142639,
   "longitude": -9.1522181,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065828/",
   "distance": "1398",
   "description": "Apartamento T3 + 1 localizado em uma área central e animada de Lisboa. O apartamento está situado em uma localização privilegiada, ao lado do Cais de Sodré, do Príncipe Real, do Chiado e do Bairro Alto. Essas áreas são conhecidas por sua vida noturna, cultura e oferta de entretenimento. O apartamento possui aproximadamente 130 metros quadrados de área bruta privativa e oferece uma série de comodidades, incluindo uma cozinha totalmente equipada, ar condicionado, dois lugares de estacionamento e duas arrecadações. Ele tem a vantagem de receber muita luz natural. O apartamento está distribuído da seguinte forma: Hall de entrada Sala de estar Cozinha Quarto principal em suíte com banheiro privativo (Wc) Área de circulação Banheiro adicional (Wc) Dois quartos adicionais Um escritório Dois lugares de estacionamento Duas arrecadações O apartamento é facilmente acessível por meio de transporte público, com proximidade a uma estação ferroviária, pontos de autocarros, uma estação fluvial e o metrô. Isso facilita a deslocação pela cidade. Poderá usufruir do conforto da proximidade de viver no centro da cidade e destaca várias áreas próximas, como Santos, a Rua Verde, a Praça das Flores, a Assembleia da República, o Mercado da Ribeira, o Time-Out e o Cais do Sodré. Isso significa que os moradores terão fácil acesso a restaurantes, lojas, atrações culturais e de lazer. Se estiver interessado neste apartamento, pode entrar em contato e obter mais informações, disponibilidade e outros detalhes relevantes.",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "hasLift": true,
   "parkingSpace": {
    "hasParkingSpace": true,
    "isParkingSpaceIncludedInPrice": true
   },
   "priceByArea": 6769.0,
   "detailedType": {
    "typology": "flat"
   },
   "suggestedTexts": {
    "subtitle": "Misericórdia, Lisboa",
    "title": "Apartamento"
   },
   "hasPlan": true,
   "has3DTour": true,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065838",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/99/cb/af/230326626.jpg",
   "numPhotos": 35,
   "price": 1590000.0,
   "propertyType": "chalet",
   "operation": "sale",
   "size": 202.0,
   "rooms": 3,
   "bathrooms": 4,
   "address": "Cais do Sodré - Santos",
   "province": "Lisboa",
   "municipality": "Misericórdia",
   "district": "Cais do Sodré - Santos",
   "country": "pt",
   "latitude": 38.7105862,
   "longitude": -9.1520388,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065838/",
   "distance": "1670",
   "description": "Bem-vindo ao seu oásis urbano no coração de Lisboa! Esta espetacular moradia combina a conveniência de estar no centro da cidade com a tranquilidade de um jardim e uma piscina privativa. Principais características: Localização central: Esta moradia está situada em uma das áreas mais desejadas de Lisboa, a poucos passos de comercio tradicional, museus, restaurantes, esplanadas, farmácias, bancos, todo o tipo de serviços, espaços culturas, transportes ( elétrico, autocarros, comboio, metro ), próximo do rio, Bairro Alto, Príncipe Real, Cais do Sodré e Mercado da Ribeira. Você estará imerso na energia vibrante da capital portuguesa. Jardim tranquilo: O amplo jardim é um refúgio de paz e serenidade no meio da agitação da cidade. Plantas e um paisagismo cuidadosamente projetado criam um espaço perfeito para relaxar, fazer piqueniques e desfrutar de refeições ao ar livre. Piscina privativa: Refresque-se nos dias quentes de verão na piscina privativa. É o lugar ideal para relaxar e se divertir com amigos e família. A moradia desenvolve-se em R/C e 1 piso, destinado à habitação no R/C e 1 piso, na zona exterior é destinado a lazer e a estacionamento e uma área de serviço. No piso térreo vamos encontrar um jardim, piscina, estacionamento e zona de circulação. No piso térreo da moradia é composta por sala em openspace com acesso ao jardim, cozinha totalmente equipada, zona de refeições e sala de estar, wc social e arrumos. O primeiro piso é a zona privada com três suites, instalação sanitária privada, uma das suites com closet e zona de circulação. Esta é uma oportunidade única de possuir uma moradia que combina o melhor do estilo de vida urbano com a privacidade de um espaço ao ar livre. Não perca a oportunidade de viver no centro de Lisboa, em um refúgio de tranquilidade e luxo. Agende uma visita hoje e faça desta propriedade o seu lar no coração da cidade.",
   "hasVideo": true,
   "status": "good",
   "newDevelopment": false,
   "parkingSpace": {
    "hasParkingSpace": true,
    "isParkingSpaceIncludedInPrice": true
   },
   "priceByArea": 7871.0,
   "detailedType": {
    "typology": "chalet",
    "subTypology": "independantHouse"
   },
   "suggestedTexts": {
    "subtitle": "Misericórdia, Lisboa",
    "title": "Moradia independente"
   },
   "hasPlan": true,
   "has3DTour": true,
   "has360": false,
   "hasStaging": false,
   "labels": [
    {
     "name": "villaType",
     "text": "Villa"
    }
   ],
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065825",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/d8/bd/55/230326495.jpg",
   "externalReference": "A059",
   "numPhotos": 16,
   "floor": "bj",
   "price": 149000.0,
   "propertyType": "flat",
   "operation": "sale",
   "size": 32.0,
   "rooms": 1,
   "bathrooms": 1,
   "address": "Rua do Sol a Santa Catarina",
   "province": "Lisboa",
   "municipality": "Misericórdia",
   "district": "Santa Catarina",
   "country": "pt",
   "latitude": 38.7103738,
   "longitude": -9.1505583,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065825/",
   "distance": "1608",
   "description": "Excelente T0+1, localizado em zona histórica e muito central. Composto por 1 sala ampla, 1 quarto, 1 cozinha e uma casa de banho. Apartamento usado e em bom estado de conservação. Inserido em prédio pequeno de traça antiga em ótimo estado. A sua localização é perfeita quer para habitação quer para rentabilizar no mercado de arrendamento. Situado na freguesia da Misericórdia, coração da cidade de Lisboa a poucos minutos a pé do Chiado, Cais do Sodré, Elevador da Bica, Miradouro de Santa Catarina assim como do Metro e do Comboio. Não perca a oportunidade e venha conhecer! Excellent T0+1, located in a historic and very central area. With 1 large living room, 1 bedroom, 1 kitchen and a bathroom. Apartment used and in good condition. Inserted in a small old building in excellent condition. Its location is perfect both for housing and for making money on the rental market. Located in the parish of Misericórdia, heart of the city of Lisbon, just a few minutes walk from Chiado, Cais do Sodré, Elevador da Bica, Miradouro de Santa Catarina as well as the Metro and Train. Don't miss the opportunity and come to see!",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "hasLift": false,
   "priceByArea": 4656.0,
   "detailedType": {
    "typology": "flat"
   },
   "suggestedTexts": {
    "subtitle": "Misericórdia, Lisboa",
    "title": "Apartamento na Rua do Sol a Santa Catarina"
   },
   "hasPlan": true,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33064379",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/46/d6/7e/230326261.jpg",
   "numPhotos": 19,
   "floor": "1",
   "price": 580000.0,
   "propertyType": "flat",
   "operation": "sale",
   "size": 110.0,
   "rooms": 3,
   "bathrooms": 2,
   "address": "São Martinho do Porto",
   "province": "Leiria",
   "municipality": "São Martinho do Porto",
   "country": "pt",
   "latitude": 39.5067386,
   "longitude": -9.1318862,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33064379/",
   "distance": "87259",
   "description": "Apartamento T 3, Novo, Vista mar, 3 quartos, 2 casas de banho, sala/cozinha equipada, 2 elevadores, lugar de garagem, arrecadação, piscina, inserido num condomínio fechado.",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "hasLift": true,
   "parkingSpace": {
    "hasParkingSpace": true,
    "isParkingSpaceIncludedInPrice": true
   },
   "priceByArea": 5273.0,
   "detailedType": {
    "typology": "flat"
   },
   "suggestedTexts": {
    "subtitle": "São Martinho do Porto, Alcobaça",
    "title": "Apartamento"
   },
   "hasPlan": false,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "labels": [
    {
     "name": "seaViewsType",
     "text": "Vista mar"
    }
   ],
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065803",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/df/80/48/230326054.jpg",
   "externalReference": "WS.0213",
   "numPhotos": 19,
   "price": 690000.0,
   "propertyType": "chalet",
   "operation": "sale",
   "size": 92.0,
   "rooms": 1,
   "bathrooms": 1,
   "address": "Vale de Choupos - Choilo - Galeotas",
   "province": "Setúbal",
   "municipality": "Azeitão",
   "district": "Vale de Choupos - Choilo - Galeotas",
   "country": "pt",
   "latitude": 38.5366783,
   "longitude": -9.0089176,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065803/",
   "distance": "23518",
   "description": "Terreno Misto para venda em Azeitão Lote de terreno com 5.033 m2 rustico, com casa construída de 92 m2 urbana, o imóvel é composto por cozinha em open espace com sala de estar, hall interior, casa de banho completa com banheira e dois quartos.  o imóvel necessita de obras de melhoramento, embora seja habitável, no exterior existe uma piscina que necessita de ser recuperada.  Lote de terreno com área bastante generosa onde existe um parecer da câmara de Setúbal com viabilidade de construção de 4 fogos no lote ou a divisão do mesmo em dois e possibilidade de construção de 8 fogos.  excelente oportunidade de negocio para quem pretende habitação com muito espaço exterior ou para que pretenda investir em construção, localizado no centro das galeotas, junto a estrada principal.  **** Terrain mixte à vendre à Azeitão Terrain de 5 033 m2 rustique, avec une maison construite de 92 m2 urbaine, la propriété se compose d'une cuisine ouverte avec salon, hall intérieur, salle de bain complète avec baignoire et deux chambres. la propriété a besoin de travaux d'amélioration, même si elle est habitable, à l'extérieur il y a une piscine qui doit être restaurée. Terrain d'une superficie très généreuse où il y a un avis de la mairie de Setúbal avec la faisabilité de construire 4 logements sur le terrain ou de le diviser en deux et la possibilité de construire 8 logements. excellente opportunité commerciale pour ceux qui recherchent un logement avec beaucoup d'espace extérieur ou pour ceux qui cherchent à investir dans la construction, située au centre de Galeotas, à côté de la route principale. **** Mixed land for sale in Azeitão Plot of land with 5,033 m2 rustic, with a built house of 92 m2 urban, the property consists of an open space kitchen with living room, interior hall, complete bathroom with bathtub and two bedrooms. the property needs improvement works, although it is habitable, outside there is a swimming pool that needs to be restored. Plot of land with a very generous area where there is an opinion from the Setúbal council with the feasibility of building 4 dwellings on the plot or dividing it into two and the possibility of building 8 dwellings. excellent business opportunity for those looking for housing with lots of outdoor space or for those looking to invest in construction, located in the center of Galeotas, next to the main road.",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "priceByArea": 7500.0,
   "detailedType": {
    "typology": "chalet",
    "subTypology": "independantHouse"
   },
   "suggestedTexts": {
    "subtitle": "Azeitão, Setúbal",
    "title": "Moradia independente"
   },
   "hasPlan": false,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "32778186",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/4b/91/bc/230325253.jpg",
   "numPhotos": 30,
   "floor": "6",
   "price": 295000.0,
   "propertyType": "flat",
   "operation": "sale",
   "size": 78.0,
   "rooms": 3,
   "bathrooms": 2,
   "address": "R. Francisco Mantero",
   "province": "Lisboa",
   "municipality": "Olivais",
   "country": "pt",
   "latitude": 38.7806998,
   "longitude": -9.1230761,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/32778186/",
   "distance": "6682",
   "description": "Apartamento totalmente renovado situado nos Olivais  O apartamento tem as seguintes características: - uma suíte com roupeiro embutido (casa de banho com duche, loiças Roca) - dois quarto, também com roupeiro embutido, casa de banho com duche, louças Roca - sala com cozinha em open space equipada com electrodomésticos Teka (frigorífico; máquina de lavar loiça; máquina de lavar roupa; microondas; forno; placa de indução e caldeira). Caixilharia com janelas oscilo batentes. Este apartamento está localizado numa zona tranquila, fácil de estacionar e onde pode encontrar todo o tipo de comércio local. Junto ao aeroporto de Lisboa, bem como aos transportes públicos, nomeadamente ( Autocarro, Metro).  Esta zona desfruta ainda da área comercial com Mercado Municipal, supermercados, Restaurantes e farmácias. Escolas, jardins e o Parque Vale do Silêncio também fazem parte da zona envolvente, tornando um lugar harmonioso para viver e a poucos minutos da azáfama do centro da grande cidade. Disponível para visitas. Não guarde para amanhã o que pode fazer hoje, venha visitar!",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "hasLift": true,
   "priceByArea": 3782.0,
   "detailedType": {
    "typology": "flat"
   },
   "suggestedTexts": {
    "subtitle": "Olivais, Lisboa",
    "title": "Apartamento em R. Francisco Mantero"
   },
   "hasPlan": true,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "highlight": {
    "groupDescription": "Destaque"
   },
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065764",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/b4/d9/da/230325586.jpg",
   "externalReference": "C0483-00318",
   "numPhotos": 23,
   "floor": "bj",
   "price": 292500.0,
   "propertyType": "flat",
   "operation": "sale",
   "size": 126.0,
   "rooms": 2,
   "bathrooms": 2,
   "address": "Rua Manuel Alfredo Tito Morais, 15",
   "province": "Lisboa",
   "municipality": "Loures",
   "district": "Barro - Pinheiro de Loures",
   "country": "pt",
   "latitude": 38.8337488,
   "longitude": -9.1947558,
   "showAddress": true,
   "url": "https://www.idealista.pt/imovel/33065764/",
   "distance": "13319",
   "description": "Apartamento T2 localizado na Urbanização Casal do Covão em Loures em zona de moradias com vista desafogada, a 5 minutos do centro de Loures. Com acesso à A8, A1, CREL, CRIL, ao comércio e serviços, em 5-10 minutos Com exposição solar nascente-poente oferece ao apartamento uma luz natural ao longo do dia. Este apartamento possui 3 ótimas assoalhadas com ar condicionado, aspiração central, sendo composto por: Cozinha equipada e sala com áreas bastante generosas Dois quartos, (1 suíte) com boas áreas e roupeiros embutidos Espaçoso hall de entrada Casa de banho principal com banheira Se privilegia o lazer em família ou amigos, este apartamento é composto por um maravilhoso terraço com área de 40m2 e acesso direto á cozinha e á sala 1 Lugar de garagem Prédio sem Elevador Venha visitar a sua futura morada!",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "hasLift": true,
   "priceByArea": 2321.0,
   "detailedType": {
    "typology": "flat"
   },
   "suggestedTexts": {
    "subtitle": "Loures",
    "title": "Apartamento na Rua Manuel Alfredo Tito Morais, 15"
   },
   "hasPlan": false,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065706",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/92/0f/fd/230325167.jpg",
   "externalReference": "120401015-2556",
   "numPhotos": 32,
   "floor": "2",
   "price": 190000.0,
   "propertyType": "flat",
   "operation": "sale",
   "size": 75.0,
   "rooms": 2,
   "bathrooms": 1,
   "address": "Rua Cidade do Lobito",
   "province": "Setúbal",
   "municipality": "Corroios",
   "district": "Centro",
   "country": "pt",
   "latitude": 38.6439842,
   "longitude": -9.1584281,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065706/",
   "distance": "8826",
   "description": "QUINTA DE SÃO NICOLAU | 3 ASS. TOTALMENTE REMODELADO Localizado na Quinta de São Nicolau em Corroios. O que mais destaca esta zona é o acesso aos principais transportes públicos, acessos rodoviários, comércio e serviços. Apartamento com remodelação a estrear, onde foram utilizados materiais de grande qualidade.  A empresa responsável por esta remodelação tem, ao longo dos anos, pensado como tornar os apartamentos versáteis para o bem estar diário da vida familiar. - Cozinha equipada com placa de indução, forno, exaustor, micro-ondas e máquina de lavar loiça.  - Quarto com varanda - Quarto com roupeiro - Casa de banho com cabine de duche - Despensa com termo acumulador e local para máquina de lavar roupa Destaco ainda a luminosidade e vista desafogada. As Fotografias de home-staging virtual permitem ter uma ideia de aproveitamento do espaço. Agora ligue-me e venha conhecer aquele que pode ser o futuro Lar.",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "hasLift": false,
   "priceByArea": 2533.0,
   "detailedType": {
    "typology": "flat"
   },
   "suggestedTexts": {
    "subtitle": "Corroios, Seixal",
    "title": "Apartamento na Rua Cidade do Lobito"
   },
   "hasPlan": true,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065750",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/7a/52/6e/230325266.jpg",
   "numPhotos": 10,
   "price": 550000.0,
   "propertyType": "chalet",
   "operation": "sale",
   "size": 220.0,
   "rooms": 6,
   "bathrooms": 5,
   "address": "Alcoitão s/n",
   "province": "Lisboa",
   "municipality": "Alcabideche",
   "district": "Alcoitão",
   "country": "pt",
   "latitude": 38.7339725,
   "longitude": -9.3941957,
   "showAddress": true,
   "url": "https://www.idealista.pt/imovel/33065750/",
   "distance": "22134",
   "description": "Alcoitão- Alcabideche- Cascais  Moradia em fase de construção, sendo vendida no estado em que se encontra, ficando o final da obra a cargo do comprador. Moradia T4 + T2 em construção com jardim e piscina em Alcoitão;  Projecto aprovado pela Câmara. M. Cascais Inserida num lote de 300 m2, é composta por três pisos com a seguinte distribuição: Cave:  Garagem para dois carros, e um apartamento T2  No rés-do-chão encontramos uma sala, cozinha em ilha, zona de lavandaria, casa de banho social, 1 escritório/ quanto O primeiro andar conta com três suítes cada com 17m2 todas com closet, varanda comum a duas suites Na zona exterior encontramos um jardim e piscina A disposição deste imóvel aliado à sua localização beneficia de exposição solar, nascente, poente, sul. Localizada em zona tranquila de moradias, próxima de várias escolas internacionais e a 5 minutos dos acessos da A5 e A16 e a 10 minutos do centro de Cascais e Sintra Alcoitão é uma freguesia do conselho de Cascais conhecida por ser uma zona residencial calma. Próximo de espaços verdes, restaurantes, cafés, pastelarias, comércio local e de escolas  Com acessos facilitados ao Estoril, à A5, à A1, e a Lisboa.",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "parkingSpace": {
    "hasParkingSpace": true,
    "isParkingSpaceIncludedInPrice": true
   },
   "priceByArea": 2500.0,
   "detailedType": {
    "typology": "chalet",
    "subTypology": "independantHouse"
   },
   "suggestedTexts": {
    "subtitle": "Alcabideche, Cascais",
    "title": "Moradia independente em Alcoitão s/n"
   },
   "hasPlan": true,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "labels": [
    {
     "name": "villaType",
     "text": "Villa"
    }
   ],
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065723",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/4c/ba/8d/230324776.jpg",
   "externalReference": "124771033-59",
   "numPhotos": 10,
   "price": 160000.0,
   "propertyType": "chalet",
   "operation": "sale",
   "size": 134.0,
   "rooms": 3,
   "bathrooms": 2,
   "address": "Rua do Cabeção s/n",
   "province": "Évora",
   "municipality": "Mora",
   "country": "pt",
   "latitude": 38.9515086,
   "longitude": -8.1487913,
   "showAddress": true,
   "url": "https://www.idealista.pt/imovel/33065723/",
   "distance": "89517",
   "description": "Moradia térrea com três quartos, garagem e um quintal bastante amplo, que lhe vai proporcionar um ambiente perfeito para relaxar na companhia da sua familia. A moradia é constituída por 3 quartos, sala, 2 casas de banho, cozinha, marquise e também um sótão bastante amplo, onde tem a possibilidade de fazer mais quartos. Tem também um anexo e uma garagem. A área descoberta totaliza 476m2 e a área coberta 207m2. Para mais informações e agendamento de visitas, entre em contato.  Não deixe escapar esta oportunidade única, marque já a sua visita!  .",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "priceByArea": 1194.0,
   "detailedType": {
    "typology": "chalet"
   },
   "suggestedTexts": {
    "subtitle": "Mora",
    "title": "Moradia na Rua do Cabeção s/n"
   },
   "hasPlan": false,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065721",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/3d/c1/b9/230324704.jpg",
   "externalReference": "123781002-104",
   "numPhotos": 34,
   "price": 279000.0,
   "propertyType": "chalet",
   "operation": "sale",
   "size": 276.0,
   "rooms": 2,
   "bathrooms": 2,
   "address": "São Martinho do Porto",
   "province": "Leiria",
   "municipality": "São Martinho do Porto",
   "country": "pt",
   "latitude": 39.5179001,
   "longitude": -9.1365344,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065721/",
   "distance": "88498",
   "description": "    Procura uma moradia em são martinho do porto? tenha a oportuidade de conhecer esta moradia com muito potencial, moradia numa zona de facil acesso, com espaço exterior e garagem, proximo do mercado e do centro de são martinho do proto. Moradia composta de Hall entrada, sala, cozinha, quarto, casa de banho, quarto, garagem, marquise e sotão com varanda, a moradia encontra se a precisar de obras. Marque a uma visita e venha conhecer:.",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "priceByArea": 1011.0,
   "detailedType": {
    "typology": "chalet"
   },
   "suggestedTexts": {
    "subtitle": "São Martinho do Porto, Alcobaça",
    "title": "Moradia"
   },
   "hasPlan": false,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065629",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/30/60/c7/230324131.jpg",
   "externalReference": "EHPPS047",
   "numPhotos": 13,
   "price": 170000.0,
   "propertyType": "flat",
   "operation": "sale",
   "size": 150.0,
   "rooms": 3,
   "bathrooms": 2,
   "address": "Bombarral e Vale Covo",
   "province": "Leiria",
   "municipality": "Bombarral e Vale Covo",
   "country": "pt",
   "latitude": 39.274519,
   "longitude": -9.1553429,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065629/",
   "distance": "61452",
   "description": "Descubra o conforto e a elegância neste espaçoso apartamento com 3 quartos em pleno coração do Bombarral. Com suíte luminosa, aquecimento central a gás e cozinha totalmente equipada, este lar de 150m² é perfeito para famílias. Inclui garagem privativa e uma generosa arrecadação no sótão. Não perca a oportunidade de tornar este espaço a sua nova casa.",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "parkingSpace": {
    "hasParkingSpace": true,
    "isParkingSpaceIncludedInPrice": true
   },
   "priceByArea": 1133.0,
   "detailedType": {
    "typology": "flat"
   },
   "suggestedTexts": {
    "subtitle": "Bombarral e Vale Covo, Bombarral",
    "title": "Apartamento"
   },
   "hasPlan": true,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065677",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/180/id.pro.pt.image.master/06/fa/51/230324016.jpg",
   "externalReference": "513B/2023AL",
   "numPhotos": 11,
   "floor": "1",
   "price": 375000.0,
   "propertyType": "studio",
   "operation": "sale",
   "size": 46.0,
   "rooms": 0,
   "bathrooms": 1,
   "address": "Centro - Nova Campolide",
   "province": "Lisboa",
   "municipality": "Campolide",
   "district": "Centro - Nova Campolide",
   "country": "pt",
   "latitude": 38.7242841,
   "longitude": -9.1601965,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065677/",
   "distance": "1815",
   "description": "Estúdio em condomínio de luxo, com piscina no terraço e piscina aquecida, ginásio, spa, jardim e parqueamento. Características: - Sala/Quarto com Kitchenette equipada; - Casa-de-banho com piso aquecido; - 1 Lugar de garagem. Com uma localização privilegiada, encontra-se a apenas alguns passos da prestigiada Avenida da Liberdade, Marques do Pombal, comércio, escolas e do coração do centro financeiro da cidade. \"Fotos do andar modelo\" Agende sua visita!",
   "hasVideo": true,
   "status": "good",
   "newDevelopment": false,
   "hasLift": true,
   "parkingSpace": {
    "hasParkingSpace": true,
    "isParkingSpaceIncludedInPrice": true
   },
   "priceByArea": 8152.0,
   "detailedType": {
    "typology": "flat",
    "subTypology": "studio"
   },
   "suggestedTexts": {
    "subtitle": "Campolide, Lisboa",
    "title": "T0"
   },
   "hasPlan": false,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065649",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/bd/6e/e4/230323868.jpg",
   "externalReference": "512B/2023AL",
   "numPhotos": 23,
   "floor": "3",
   "price": 595000.0,
   "propertyType": "flat",
   "operation": "sale",
   "size": 150.0,
   "rooms": 3,
   "bathrooms": 2,
   "address": "Rana",
   "province": "Lisboa",
   "municipality": "São Domingos de Rana",
   "district": "Rana",
   "country": "pt",
   "latitude": 38.6961577,
   "longitude": -9.34847,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065649/",
   "distance": "18358",
   "description": "Apartamento novo, ótimas áreas, com parqueamento e arrecadação, em prédio com 2 elevadores, composto por: hall, sala com ampla varanda, cozinha equipada, 1 suite, 2 quartos, casa de banho de apoio aos quartos, varanda. Possui ar condicionado, estores elétricos, vidros duplos, porta de segurança, vídeo porteiro. Localiza-se próximo a comércio local, LIDL, CUF São Domingos de Rana, Colégio Salesianos, transportes. Rápidos acessos a auto-estrada. Agende sua visita!",
   "hasVideo": true,
   "status": "good",
   "newDevelopment": false,
   "hasLift": true,
   "parkingSpace": {
    "hasParkingSpace": true,
    "isParkingSpaceIncludedInPrice": true
   },
   "priceByArea": 3967.0,
   "detailedType": {
    "typology": "flat"
   },
   "suggestedTexts": {
    "subtitle": "São Domingos de Rana, Cascais",
    "title": "Apartamento"
   },
   "hasPlan": true,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065656",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/5e/dd/dd/230323583.jpg",
   "numPhotos": 30,
   "floor": "4",
   "price": 498000.0,
   "propertyType": "flat",
   "operation": "sale",
   "size": 132.0,
   "rooms": 2,
   "bathrooms": 1,
   "address": "Rua Alfredo Soares",
   "province": "Lisboa",
   "municipality": "Belém",
   "district": "Restelo",
   "country": "pt",
   "latitude": 38.7121793,
   "longitude": -9.2093958,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065656/",
   "distance": "6162",
   "description": "Apartamento T2 com muito potencial para remodelação, localizado em Belém, nas Torres de Lisboa. Com uma área de 120m2, este imóvel oferece uma vista desafogada e está próximo do Hospital São Francisco Xavier. Possui um lugar de garagem e está situado no 4º andar, sem elevador. Aproveite esta oportunidade para criar o apartamento dos seus sonhos! Não perca tempo e agende já a sua visita.",
   "hasVideo": false,
   "status": "renew",
   "newDevelopment": false,
   "hasLift": true,
   "parkingSpace": {
    "hasParkingSpace": true,
    "isParkingSpaceIncludedInPrice": true
   },
   "priceByArea": 3773.0,
   "detailedType": {
    "typology": "flat"
   },
   "suggestedTexts": {
    "subtitle": "Belém, Lisboa",
    "title": "Apartamento na Rua Alfredo Soares"
   },
   "hasPlan": true,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "32808023",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/e5/54/d2/220519472.jpg",
   "externalReference": "3034",
   "numPhotos": 24,
   "price": 725000.0,
   "propertyType": "chalet",
   "operation": "sale",
   "size": 384.0,
   "rooms": 4,
   "bathrooms": 3,
   "address": "Pontinha e Famões",
   "province": "Lisboa",
   "municipality": "Pontinha e Famões",
   "country": "pt",
   "latitude": 38.7975708,
   "longitude": -9.2223415,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/32808023/",
   "distance": "11057",
   "description": "Ref. : 3034 EXCLUSIVO BLYSS REAL ESTATE Magnifica moradia em fase de construção, com previsão de entrega com licença em Maio de 2024.  Acabamentos de qualidade, equipamentos topo de gama e luminosidade impar permitem usufruir de conforto e funcionalidade neste imóvel, do qual possui as seguintes características: Piso -1: - Garagem com 70m2 na cave com possibilidade para 3 viaturas; - Área técnica com 6 m2; Piso 1: - Sala com 45m2 e varanda de 12m2; - Cozinha com 17m2, totalmente equipada; - Hall de entrada com 6m2; - Wc apoio com 5 m2, Piso 2: - Suite com 20m2, com roupeiro em closet, Wc de 6m2 e varanda com 5m2; - Quarto com 16m2, com roupeiro e varanda com 5 m2; - Quarto com 17m2, com roupeiro e varanda com 5 m2; - Wc com 6 m2; - Hall dos quartos com 6 m2; Piso 3: - Arrumo/Escritorio/Quarto com 14m2; - Terraço com 70 m2 Localizada em zona tranquila, com uma fantástica vista desafogada e com acesso privilegiado aos principais eixos rodoviários de circulação da grande Lisboa. Contacte-nos para visitar este fantástico imóvel. * Todas as informações apresentadas não têm qualquer carácter vinculativo, não dispensa a confirmação por parte da mediadora, bem como a consulta da documentação do imóvel *.",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "priceByArea": 1888.0,
   "detailedType": {
    "typology": "chalet"
   },
   "suggestedTexts": {
    "subtitle": "Pontinha e Famões, Odivelas",
    "title": "Moradia"
   },
   "hasPlan": true,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065404",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/cf/54/63/230314804.jpg",
   "externalReference": "5011BR20",
   "numPhotos": 25,
   "floor": "1",
   "price": 280000.0,
   "propertyType": "flat",
   "operation": "sale",
   "size": 105.0,
   "rooms": 2,
   "bathrooms": 2,
   "address": "Barro - Pinheiro de Loures",
   "province": "Lisboa",
   "municipality": "Loures",
   "district": "Barro - Pinheiro de Loures",
   "country": "pt",
   "latitude": 38.8314613,
   "longitude": -9.1969639,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065404/",
   "distance": "13153",
   "description": "Ref. : 5011B EXCLUSIVO BLYSS REAL ESTATE Apartamento T2 Novo, com parqueamento e arrecadação, situado em zona calma e aprazível, com zonas verdes, perto dos principais acessos e com transportes rodoviários à porta. O apartamento em questão está localizado num edifício que se encontra finalizado e pronto a escriturar! CARACTERÍSTICAS: - Área útil - 80 m2; - Àrea Bruta - 105 m2 - Cozinha e Sala em open space com 26,50 m2; - Suite com 16,55 m2, com roupeiro e varanda com 4 m2; - Wc Suite com 3,00 m2 e poliban; - Quarto com 13 m2, com roupeiro e varanda com 4,5 m2; - Wc Serviço com 5,80 m2, completa e com banheira; - Parqueamento para 1 viatura preparado com tomada para carregamento de carro eléctrico; - Arrecadação ao lado do parqueamento com cerca de 8 m2; ACABAMENTOS: - Tetos Falsos em todo o apartamento com iluminação LED; - Pavimento em todo o apartamento em flutuante vinílico de excelente qualidade; - Porta Blindada; - Caixilharia com corte térmico e acústico e com oscilobatente; - Vidros Duplos; - Estores Elétricos e Térmicos; - Gás Canalizado; Equipamentos: - Ar condicionado completo (marca a definir); - Aspiração central; - Vídeo porteiro; - Painéis Solares (aquecimento de água); - Cozinha equipada com: (placa indução, micro-ondas, forno, combinado, exaustor, máquina de lavar e secar roupa e máquina lavar loiça), todos da marca AEG ou equivalente; Contacte-nos para visitar este fantástico imóvel. * Todas as informações apresentadas não têm qualquer carácter vinculativo, não dispensa a confirmação por parte da mediadora, bem como a consulta da documentação do imóvel *.",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "hasLift": true,
   "parkingSpace": {
    "hasParkingSpace": true,
    "isParkingSpaceIncludedInPrice": true
   },
   "priceByArea": 2667.0,
   "detailedType": {
    "typology": "flat"
   },
   "suggestedTexts": {
    "subtitle": "Loures",
    "title": "Apartamento"
   },
   "hasPlan": true,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065405",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/04/00/4f/230314865.jpg",
   "externalReference": "5011R20",
   "numPhotos": 35,
   "floor": "1",
   "price": 290000.0,
   "propertyType": "flat",
   "operation": "sale",
   "size": 144.0,
   "rooms": 2,
   "bathrooms": 2,
   "address": "Barro - Pinheiro de Loures",
   "province": "Lisboa",
   "municipality": "Loures",
   "district": "Barro - Pinheiro de Loures",
   "country": "pt",
   "latitude": 38.8308954,
   "longitude": -9.1972641,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065405/",
   "distance": "13105",
   "description": "Ref. : 5011 EXCLUSIVO BLYSS REAL ESTATE Apartamento T2 Novo, com Terraço situado em zona calma e aprazível, com zonas verdes, perto dos principais acessos e com transportes rodoviários à porta. O apartamento em questão está localizado num edifício que se encontra finalizado e pronto a Escriturar! CARACTERÍSTICAS: - Área útil - 85 m2; - Àrea Bruta - 144 m2 - Cozinha e Sala em open space com cerca de 35 m2, com acesso ao terraço; - Suite com 16,10 m2, com roupeiro; - Wc Suite com 3,50 m2 e banheira; - Quarto com 12,50 m2, com roupeiro; - Wc Serviço com 5,15 m2, completa e com poliban; - Terraço com 44 m2 com acesso pela sala/cozinha; - Parqueamento para 1 viatura preparado com tomada para carregamento de carro eléctrico; ACABAMENTOS: - Tetos Falsos em todo o apartamento com iluminação LED; - Pavimento em todo o apartamento em flutuante vinílico de excelente qualidade; - Porta Blindada; - Caixilharia com corte térmico e acústico e com oscilobatente; - Vidros Duplos; - Estores Elétricos e Térmicos; - Gás Canalizado; Equipamentos: - Ar condicionado completo (marca a definir); - Aspiração central; - Vídeo porteiro; - Painéis Solares (aquecimento de água); - Cozinha equipada com: (placa indução, micro-ondas, forno, combinado, exaustor, máquina de lavar e secar roupa e máquina lavar loiça), todos da marca AEG ou equivalente; Contacte-nos para visitar este fantástico imóvel. * Todas as informações apresentadas não têm qualquer carácter vinculativo, não dispensa a confirmação por parte da mediadora, bem como a consulta da documentação do imóvel *.",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "hasLift": true,
   "parkingSpace": {
    "hasParkingSpace": true,
    "isParkingSpaceIncludedInPrice": true
   },
   "priceByArea": 2014.0,
   "detailedType": {
    "typology": "flat"
   },
   "suggestedTexts": {
    "subtitle": "Loures",
    "title": "Apartamento"
   },
   "hasPlan": true,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065412",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/c4/12/5b/230314905.jpg",
   "externalReference": "5011CR20",
   "numPhotos": 33,
   "floor": "1",
   "price": 365000.0,
   "propertyType": "flat",
   "operation": "sale",
   "size": 145.0,
   "rooms": 3,
   "bathrooms": 2,
   "address": "Barro - Pinheiro de Loures",
   "province": "Lisboa",
   "municipality": "Loures",
   "district": "Barro - Pinheiro de Loures",
   "country": "pt",
   "latitude": 38.8322656,
   "longitude": -9.1944928,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065412/",
   "distance": "13157",
   "description": "Ref. : 5011C EXCLUSIVO BLYSS REAL ESTATE Apartamento T3 Novo, com Box para duas viaturas, situado em zona calma e aprazível, com zonas verdes, perto dos principais acessos e com transportes rodoviários à porta. O apartamento em questão está localizado num edifício que se encontra finalizado e pronto a Escriturar! CARACTERÍSTICAS: - Área útil - 115 m2; - Àrea Bruta - 145 m2 - Cozinha e Sala em open space com 39 m2; - Suite com 19 m2, com roupeiro; - Wc Suite com 3,90 m2 e poliban; - Quarto 1 com 15,50 m2, com roupeiro e varanda com 4,60 m2; - Quarto 2 com 14 m2, com roupeiro; - Wc Serviço com 5,70 m2, completa e com banheira; - Box para 2 viaturas lado a lado preparada com tomada para carregamento de carro eléctrico; ACABAMENTOS: - Tetos Falsos em todo o apartamento com iluminação LED; - Pavimento em todo o apartamento em flutuante vinílico de excelente qualidade; - Porta Blindada; - Caixilharia com corte térmico e acústico e com oscilobatente; - Vidros Duplos; - Estores Elétricos e Térmicos; - Gás Canalizado; Equipamentos: - Ar condicionado completo (marca a definir); - Aspiração central; - Vídeo porteiro; - Painéis Solares (aquecimento de água); - Cozinha equipada com: (placa indução, micro-ondas, forno, side by side (arca vertical e frigorifico vertical), exaustor, máquina de lavar e secar roupa e máquina lavar loiça), todos da marca AEG ou equivalente; Contacte-nos para visitar este fantástico imóvel. * Todas as informações apresentadas não têm qualquer carácter vinculativo, não dispensa a confirmação por parte da mediadora, bem como a consulta da documentação do imóvel *.",
   "hasVideo": true,
   "status": "good",
   "newDevelopment": false,
   "hasLift": true,
   "parkingSpace": {
    "hasParkingSpace": true,
    "isParkingSpaceIncludedInPrice": true
   },
   "priceByArea": 2517.0,
   "detailedType": {
    "typology": "flat"
   },
   "suggestedTexts": {
    "subtitle": "Loures",
    "title": "Apartamento"
   },
   "hasPlan": true,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065618",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/b2/8c/12/230323237.jpg",
   "externalReference": "00357",
   "numPhotos": 44,
   "price": 525000.0,
   "propertyType": "flat",
   "operation": "sale",
   "size": 202.0,
   "rooms": 2,
   "bathrooms": 2,
   "address": "Nazaré",
   "province": "Leiria",
   "municipality": "Nazaré",
   "country": "pt",
   "latitude": 39.5945344,
   "longitude": -9.0503757,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065618/",
   "distance": "97322",
   "description": "Esta é a última oportunidade de adquirir uma propriedade verdadeiramente única à beira-mar, e agora, com um toque ainda mais exclusivo: uma piscina privada no rooftop. Com uma vista panorâmica deslumbrante para o mar e campo, este apartamento oferece um ambiente tranquilo e relaxante que se tornará o refúgio perfeito para a sua vida.  Esta propriedade é caracterizada por espaços amplos e bem distribuídos que garantem conforto e comodidade para toda a família. Cada divisão é generosamente iluminada pela luz natural, proporcionando um ambiente acolhedor e convidativo.  Além da vista deslumbrante para o mar, esta casa incorpora uma zona verde exuberante, criando um ambiente natural e sereno que se estende até à sua própria porta. Complemento isto tudo, a verdadeira jóia desta propriedade é a piscina privada no rooftop, onde terá a oportunidade de desfrutar de momentos inesquecíveis enquanto contempla o oceano sem igual. Este espaço é um convite para relaxar, entreter e apreciar o cenário deslumbrante, tornando cada dia uma experiência única.  Além da vista deslumbrante para o mar e da piscina no rooftop, esta casa incorpora uma zona verde exuberante, criando um ambiente natural e sereno que se estende até à sua própria porta. Os bons acessos facilitam a sua mobilidade e permitem-lhe explorar a região com facilidade.  A garagem fechada oferece segurança adicional para os seus veículos e pertences. Esta é uma oportunidade única e concreta de viver à beira-mar, onde cada dia é uma celebração da vista deslumbrante, do estilo de vida tranquilo e das experiências inesquecíveis proporcionadas pela piscina privada no rooftop.  Área útil - 97,30m2  Garagem e Varandas - 105,10m2  Terraços e Logradouros - 130,60m2 Não deixe escapar esta oportunidade, entre em contato connosco agora mesmo para agendar uma visita e descobrir todas as vantagens desta propriedade exclusiva.",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "parkingSpace": {
    "hasParkingSpace": true,
    "isParkingSpaceIncludedInPrice": true
   },
   "priceByArea": 2599.0,
   "detailedType": {
    "typology": "flat"
   },
   "suggestedTexts": {
    "subtitle": "Nazaré",
    "title": "Apartamento"
   },
   "hasPlan": false,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065617",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/c3/5e/ab/230323217.jpg",
   "externalReference": "APA-APA_358",
   "numPhotos": 11,
   "price": 165000.0,
   "propertyType": "flat",
   "operation": "sale",
   "size": 99.0,
   "rooms": 3,
   "bathrooms": 2,
   "address": "Alhos Vedros",
   "province": "Setúbal",
   "municipality": "Alhos Vedros",
   "country": "pt",
   "latitude": 38.6529683,
   "longitude": -9.0233271,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065617/",
   "distance": "12669",
   "description": "Apartamento de 4 assoalhadas, (3 Quartos) num prédio de 3 pisos, de condomínio organizado, fica num 1 Andar na freguesia de Alhos Vedros, concelho de Moita. Localização calma, com excelente vizinhança, junto a transportes, comércio, serviços, comboio a 5 minutos a pé.  Facilidade de estacionamento, ótimos acessos, próximo dos principias acessos às autoestradas A33, A39 e A2. Prédio de 1995, Apartamento com apenas com 10 anos de habitação Coluna central de aguas com menos de um ano.    - Hall de entrada - 1 boa Sala com acesso a marquise - Cozinha com área generosa e boa dispensa  - 3 Quartos de boas dimensões - 2 Casa de Banho - Varanda com 5 mt. totalmente revestida com marquise   Crédito Bancário: Somos Intermediários de Crédito autorizados pelo Banco de Portugal (Reg. 4292), fazemos gestão do seu processo de financiamento, sempre com as melhores soluções do mercado. Oferecemos todo o acompanhamento pré e pós-escritura para garantir uma transação tranquila e segura. Agende a sua Visita! FAÇA CONNOSCO A SUA PROPOSTA!",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "priceByArea": 1667.0,
   "detailedType": {
    "typology": "flat"
   },
   "suggestedTexts": {
    "subtitle": "Alhos Vedros, Moita",
    "title": "Apartamento"
   },
   "hasPlan": false,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065604",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/4b/bf/6b/230320252.jpg",
   "externalReference": "109044",
   "numPhotos": 29,
   "price": 1100000.0,
   "propertyType": "chalet",
   "operation": "sale",
   "size": 498.0,
   "rooms": 6,
   "bathrooms": 6,
   "address": "Dois Portos e Runa",
   "province": "Lisboa",
   "municipality": "Dois Portos e Runa",
   "country": "pt",
   "latitude": 39.0662158,
   "longitude": -9.2002925,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065604/",
   "distance": "38635",
   "description": "Magnifica moradia com piscina interior, de tipologia T4+2 de 3 pisos com 498m2 de área útil, inserida num lote total de 1102 m2, totalmente murada e 2 portões de acesso. Moradia com garagem para vários carros, ar condicionado, vários anexos, vários pátios e churrasqueira. Zona verde com área de lazer e várias zonas de jardim com fonte e lagos. Rés do Chão: Entrada principal servida por amplo alpendre e acesso ao Hall. Generosa Cozinha com ilha, totalmente mobilada e equipada e acesso direto a uma magnifica varanda, com vista deslumbrante para a serra. Amplo salão de refeições e sala estar com área de leitura e acesso a uma magnifica varanda. Cozinha em construção no piso -1, de apoio a toda a área interna e externa da moradia. Master suíte com excelente área, com closet, casa de banho e varanda. Casa de banho social, totalmente equipada e mobilada. Piso 1: Sala de Jogos com mesa de Snooker, ar condicionado e casa de banho de apoio. Casa de banho de apoio aos quartos totalmente equipada e mobilada. 3 amplos quartos com ar condicionado. Piso -1: Excepcional área de lazer com maravilhosa piscina interior, bar de apoio, cozinha e casa de banho, com acesso direto a todo o maravilhoso exterior com vista deslumbrante e desafogada para a serra. Anexo: Apartamento T2 totalmente independente da moradia principal. Sala em conceito open space. Cozinha em fase final de construção, com churrasqueira interna e forno a lenha. Casa de banho social de apoio aos 2 quartos. 2 Quartos com áreas amplas e ar condicionado. Localizada na bonita aldeia de penedo, na freguesia de Runa e concelho de Torres Vedras, esta maravilhosa propriedade está estrategicamente bem situada, com uma vista deslumbrante e totalmente desafogada. A cerca de 10 minutos de Torres Vedras, a 15 minutos de Alenquer, a 15 minutos do Sobral de Monte Agraço e a cerca de 40 minutos de Lisboa e do Aeroporto Internacional. Marque já a sua visita!  Não perca esta oportunidade! Carlos Constantino - IAD Portugal  Licença AMI 11220. ref: 109044.",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "parkingSpace": {
    "hasParkingSpace": true,
    "isParkingSpaceIncludedInPrice": true
   },
   "priceByArea": 2209.0,
   "detailedType": {
    "typology": "chalet"
   },
   "suggestedTexts": {
    "subtitle": "Dois Portos e Runa, Torres Vedras",
    "title": "Moradia"
   },
   "hasPlan": false,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065603",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/25/42/cb/230320217.jpg",
   "externalReference": "109042",
   "numPhotos": 15,
   "price": 157500.0,
   "propertyType": "flat",
   "operation": "sale",
   "size": 65.0,
   "rooms": 1,
   "bathrooms": 1,
   "address": "Belas Clube Campo",
   "province": "Lisboa",
   "municipality": "Queluz e Belas",
   "district": "Belas Clube Campo",
   "country": "pt",
   "latitude": 38.8126404,
   "longitude": -9.2729591,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065603/",
   "distance": "15346",
   "description": "Apartamento T1 em Belas, Sintra. T1 junto ao centro de Belas no Concelho de Sintra com fácil acesso a serviços e comércios.  Localização Central, a dois passos da Estação de Caminho de Ferro de Queluz-Belas. Totalmente acabado de ser renovado. Para residência principal ou para investimento. Apartamento com boas áreas, composto por entrada, 1 quarto, cozinha equipada com dispensa, sala e casa de banho. Ideal para pessoas com mais idade ou de mobilidade reduzida, situado no Rez de Chão. Composição: Entrada, ampla Cozinha toda equipada, 1 Quarto generoso e uma Casa de Banho, dispõe ainda de uma belíssima Sala de estar com vista para os jardins. Apartamento totalmente renovado, incluindo canalização, renovado em 2023. A iad é uma sociedade de mediação imobiliária que não tem lojas físicas, o que me permite ir ao seu encontro e prestar-lhe o melhor serviço onde quer que esteja, com base no profissionalismo e na transparência. Enquanto consultor imobiliário independente, tenho autonomia para gerir os meus horários e para negociar consigo a minha comissão, garantindo-lhe um acompanhamento personalizado em todas as etapas do processo e um serviço de qualidade ao melhor preço. Contacte me. Certificação energética: C (Desempenho energético não facilitado) IAD Portugal Licença AMI: 11220. ref: 109042.",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "priceByArea": 2423.0,
   "detailedType": {
    "typology": "flat"
   },
   "suggestedTexts": {
    "subtitle": "Queluz e Belas, Sintra",
    "title": "Apartamento"
   },
   "hasPlan": false,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065573",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/88/72/4f/230319687.jpg",
   "externalReference": "C0376-00530",
   "numPhotos": 38,
   "price": 740000.0,
   "propertyType": "chalet",
   "operation": "sale",
   "size": 340.0,
   "rooms": 4,
   "bathrooms": 3,
   "address": "Travessa Rio Velho, 1",
   "province": "Lisboa",
   "municipality": "São João das Lampas e Terrugem",
   "country": "pt",
   "latitude": 38.8702429,
   "longitude": -9.4262381,
   "showAddress": true,
   "url": "https://www.idealista.pt/imovel/33065573/",
   "distance": "29821",
   "description": "Moradia t4 com suite, 3 wc's, piscina aquecida e box. Remodelaçâo total em 2022, com isolamento térmico em capoto de 80mm em todas as superficies exteriores. Telhado, canalizaçâo pex e sistema electrico novos. Ar-condicionado com inverter e função de desumificaçâo, para arrefecimento e aquecimento. Janelas de vidros duplos com corte térmico, caixilharia em pvc e função oscilo-batente. Estores e portâo garagem electricos. Piscina aquecida com 21 m2, de agua salgada, com bomba de calor, aparelho automático de electrólise de sal, iluminaçâo led, cobertura de estore electrica e cascata de água com iluminaçâo led. Paineis solares para aquecimento de água, com ligação directa ao termo-acumulador de 300 litros com bomba de calor. Pré-instalaçâo total para paineis foto-voltaicos. Não deixe escapar esta oportunidade única e agende já a sua visita!",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "priceByArea": 2176.0,
   "detailedType": {
    "typology": "chalet",
    "subTypology": "independantHouse"
   },
   "suggestedTexts": {
    "subtitle": "São João das Lampas e Terrugem, Sintra",
    "title": "Moradia independente na Travessa Rio Velho, 1"
   },
   "hasPlan": false,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "highlight": {
    "groupDescription": "Top"
   },
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065591",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/72/ae/47/230319633.jpg",
   "externalReference": "1669-01249",
   "numPhotos": 56,
   "price": 347000.0,
   "propertyType": "chalet",
   "operation": "sale",
   "size": 409.0,
   "rooms": 5,
   "bathrooms": 2,
   "address": "Rua das Hortas, 37",
   "province": "Leiria",
   "municipality": "Usseira",
   "country": "pt",
   "latitude": 39.3256627,
   "longitude": -9.1591238,
   "showAddress": true,
   "url": "https://www.idealista.pt/imovel/33065591/",
   "distance": "67144",
   "description": "Fantástica moradia de 5 quartos, excelentes áreas, localizada na pacata freguesia da Usseira onde predominam as paisagens verdes, os moinhos de vento e a tranquilidade. Moradia com total privacidade, o portão dá acesso a um pátio interior onde existe a possibilidades de parquear o carro ou utilizar para momentos de convívio no exterior, toda a caixilharia é em PVC com vidros duplos. Composta por 3 pisos sendo o último um grande terraço com acesso através de uma bela trapeira. Todo o espaço é amplo e flui, comunicando entre si, predominam as madeiras e os elementos rústicos da zona. No Rés do Chão temos um amplo hall com um roupeiro em toda a parede e uma claraboia que lhe confere iluminação natural. Do lado direito a cozinha com móveis em madeira e bancada em pedra natural (granito) que inclui um espaço de refeições e uma sala de refeição/estar com lareira com uma salamandra embutida. Do lado esquerdo um salão também ele com lareira com salamandra embutida, um quarto com roupeiro, casa de banho completa, acesso à mezzanine que poderá funcionar como salão de jogos, ou escritório, outros 2 quartos que se encontram num piso com um desnível de 7 degraus feito através de uma robusta escada de madeira. É também através do salão que temos acesso ao piso 1 também ele através de uma escada de madeira. No 1º andar um hall de distribuição às divisões, 2 quartos com roupeiros e varandas, casa de banho completa e escada de madeira para aceder ao piso superior onde encontramos um grande terraço com privacidade onde pode disfrutar das belas paisagens do campo. Moradia para habitação principal ou secundária, para quem procura a tranquilidade da zona Oeste. Situa-se a escassos 14 min de Óbidos, 53 min até ao aeroporto de Lisboa, 16 min das Caldas da Rainha, a 26 min de Peniche, 27 min até à praia do Baleal (surf), 24 min da Praia D'El Rey (golfe), 30 min de Torres Vedras, 23 min do Royal Óbidos Spa & Golf Resort (golfe), 26 min da Lagoa de Óbidos e Praia do Bom sucesso.",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "priceByArea": 848.0,
   "detailedType": {
    "typology": "chalet",
    "subTypology": "independantHouse"
   },
   "suggestedTexts": {
    "subtitle": "Usseira, Óbidos",
    "title": "Moradia independente na Rua das Hortas, 37"
   },
   "hasPlan": false,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "32732225",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/52/d6/cc/218156478.jpg",
   "externalReference": "0739-03473",
   "numPhotos": 18,
   "price": 190000.0,
   "propertyType": "flat",
   "operation": "sale",
   "size": 48.0,
   "rooms": 1,
   "bathrooms": 1,
   "address": "Centro",
   "province": "Setúbal",
   "municipality": "Costa de Caparica",
   "district": "Centro",
   "country": "pt",
   "latitude": 38.645189,
   "longitude": -9.2334549,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/32732225/",
   "distance": "11807",
   "description": "T1 Zona Central Costa da Caparica Prédio com acesso a pessoas de mobilidade reduzida  2 Elevadores Quarto com roupeiro Próximo da praia, comércio, transportes e serviços.",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "hasLift": true,
   "priceByArea": 3958.0,
   "detailedType": {
    "typology": "flat"
   },
   "suggestedTexts": {
    "subtitle": "Costa de Caparica, Almada",
    "title": "Apartamento"
   },
   "hasPlan": false,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "highlight": {
    "groupDescription": "Destaque"
   },
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065590",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/19/2c/bf/230319552.jpg",
   "externalReference": "C0185-02971",
   "numPhotos": 74,
   "price": 220000.0,
   "propertyType": "chalet",
   "operation": "sale",
   "size": 349.0,
   "rooms": 4,
   "bathrooms": 2,
   "address": "Rua do Cabeção, 194",
   "province": "Évora",
   "municipality": "Mora",
   "country": "pt",
   "latitude": 38.949136,
   "longitude": -8.1543193,
   "showAddress": true,
   "url": "https://www.idealista.pt/imovel/33065590/",
   "distance": "88985",
   "description": "Para quem pretenda adquirir um espaço de lazer ou um imóvel para habitação permanente / secundária, assim como para investimento. Está situada 1,30 minutos de Lisboa; a 45 minutos da cidade de Évora; a 1,25 minutos de Espanha ( Badajoz Passo a apresentar-lhe uma breve descrição: Este imóvel é constituído por 2 habitações T2 + T2 térreas, dispõe ainda de dois armazém bastante amplos; um anexo para arrumos; garagem com 105 m2;  poço com bomba de tirar água e um tanque; terreno excelente para plantação ou cultivar com algumas arvores de frutos e um portão a tardoz da habitação. Dispõe ainda de aproveitamento de sótão / foros, assim como de um quintal bastante amplo. O imóvel está todo vedado e está localizado numa das melhores zonas da Vila de Mora, tendo uma vista desafogada. Para mais informações ou agendar uma visita, Ligue-me.",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "priceByArea": 630.0,
   "detailedType": {
    "typology": "chalet",
    "subTypology": "independantHouse"
   },
   "suggestedTexts": {
    "subtitle": "Mora",
    "title": "Moradia independente na Rua do Cabeção, 194"
   },
   "hasPlan": false,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065580",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/85/53/73/230319350.jpg",
   "externalReference": "6001028",
   "numPhotos": 8,
   "price": 140000.0,
   "propertyType": "penthouse",
   "operation": "sale",
   "size": 50.0,
   "rooms": 1,
   "bathrooms": 1,
   "address": "Alverca",
   "province": "Lisboa",
   "municipality": "Alverca do Ribatejo e Sobralinho",
   "district": "Alverca",
   "country": "pt",
   "latitude": 38.8965332,
   "longitude": -9.0372056,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065580/",
   "distance": "21336",
   "description": "Modernidade e Conforto no Coração de Alverca do Ribatejo - Apartamento T1+1 Apresentamos um moderno apartamento T1+1 de 50m2, localizado no centro de Alverca do Ribatejo, junto aos Bombeiros e rodeado por uma variedade de serviços e opções de transporte. Este apartamento no 3º andar, embora sem elevador, oferece uma experiência contemporânea e conveniente. Características Principais: Localização Central: Próximo aos Bombeiros e a diversos serviços essenciais. Duas Grandes Varandas: Desfrute de momentos de lazer ao ar livre com espaço para colocar uma churrasqueira e desfrutar de refeições ao ar livre. Remodelação Moderna: Última fase de remodelação com materiais modernos. Conforto: Vidros duplos, cabine de duche, cozinha totalmente elétrica e equipada, porta blindada, etc. Entrega Rápida: Será entregue chave na mão no prazo máximo de 30 dias. Este é um convite para viver numa residência moderna, onde o design contemporâneo se combina com a conveniência do quotidiano. Se procura um espaço pronto para habitar, com um toque moderno e próximo de todas as comodidades, este apartamento em Alverca do Ribatejo pode ser a escolha perfeita. Não hesite em contactar para mais informações ou para agendar uma visita.",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "priceByArea": 2800.0,
   "detailedType": {
    "typology": "flat",
    "subTypology": "penthouse"
   },
   "suggestedTexts": {
    "subtitle": "Alverca do Ribatejo e Sobralinho, Vila Franca de Xira",
    "title": "Penthouse"
   },
   "hasPlan": false,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065541",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/39/bd/28/230316801.jpg",
   "externalReference": "A/01439",
   "numPhotos": 20,
   "price": 325000.0,
   "propertyType": "flat",
   "operation": "sale",
   "size": 63.0,
   "rooms": 2,
   "bathrooms": 1,
   "address": "Avenida do Uruguai",
   "province": "Lisboa",
   "municipality": "Benfica",
   "district": "Avenida do Uruguai",
   "country": "pt",
   "latitude": 38.7479809,
   "longitude": -9.1989867,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065541/",
   "distance": "5915",
   "description": "OFERTA ATO UNICO ESCRITURA E REGISTOS. Benfica. Apartamento T2 totalmente remodelado. Cozinha equipada. Quartos com roupeiros. Ar condicionado. Estores elétricos. Junto ao Parque silva porto / parque grão vasco / mata de Benfica. Mercado Benfica. Próximo do comboio e centro comercial colombo.!",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "hasLift": true,
   "priceByArea": 5159.0,
   "detailedType": {
    "typology": "flat"
   },
   "suggestedTexts": {
    "subtitle": "Benfica, Lisboa",
    "title": "Apartamento"
   },
   "hasPlan": false,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065516",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/c4/39/fa/230316457.jpg",
   "externalReference": "PTC202311221001",
   "numPhotos": 27,
   "price": 360000.0,
   "propertyType": "chalet",
   "operation": "sale",
   "size": 275.0,
   "rooms": 3,
   "bathrooms": 3,
   "address": "Cadaval e Pêro Moniz",
   "province": "Lisboa",
   "municipality": "Cadaval e Pêro Moniz",
   "country": "pt",
   "latitude": 39.2491801,
   "longitude": -9.1105968,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065516/",
   "distance": "58672",
   "description": "Moradia T3 nova, pronta para morar em Cadaval. De construção moderna com arquitetura e técnicas de construção atuais, bem equipada e com vista campo / Serra do Montejunto. Na entrada da Vila do Cadaval com excelentes acessos, esta moradia, mercê da implantação efetuada recolhe uma excelente luz natural que entra pelas grandes janelas da sala e cozinha em open space e se espalha pelo seu interior tornando os espaços amplos acolhedores.  A vista que terá na sala ou cozinha enche o coração com a serra do Montejunto e o verde dos campos no horizonte.  No piso térreo tem: Zona entrada hall de circulação, 3 quartos (um em suite), WC social, cozinha e sala em open space. Acesso varanda exterior de grande dimensão  Piso - 1  Garagem, sala (escritório, cozinha, sala multimédia), acesso zona exterior.  Exterior  Zona jardim, patio, varanda de grandes dimensões em volta da moradia com vista campo soberba.  Equipamento  Painéis solares águas quentes, estores eléctricos, caixilharia de alto desempenho, iluminação sistema LED, cozinha semi equipada, portões eléctricos garagem e acesso propriedade com vídeo porteiro digital a cores.  Construção de qualidade com isolamento total no sistema ICF.  Lisboa a 45 minutos via A8, transportes públicos diretos para Lisboa em Autocarro.  Certificação energética A+ Venha viver connosco!",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "parkingSpace": {
    "hasParkingSpace": true,
    "isParkingSpaceIncludedInPrice": true
   },
   "priceByArea": 1309.0,
   "detailedType": {
    "typology": "chalet"
   },
   "suggestedTexts": {
    "subtitle": "Cadaval e Pêro Moniz, Cadaval",
    "title": "Moradia"
   },
   "hasPlan": true,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065507",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/fc/55/08/230316347.jpg",
   "externalReference": "007.556.138",
   "numPhotos": 23,
   "floor": "3",
   "price": 151900.0,
   "propertyType": "flat",
   "operation": "sale",
   "size": 90.0,
   "rooms": 3,
   "bathrooms": 1,
   "address": "Rua Dom Afonso de Albuquerque, 2",
   "province": "Setúbal",
   "municipality": "Alto do Seixalinho - Santo André - Verderena",
   "district": "Santo André",
   "country": "pt",
   "latitude": 38.6452531,
   "longitude": -9.0547585,
   "showAddress": true,
   "url": "https://www.idealista.pt/imovel/33065507/",
   "distance": "11262",
   "description": "Gostaria de viver no centro da Quinta da Lomba?  Apresentamos este apartamento com 4 assoalhadas, localizado junto à paragem dos transportes, perto de serviços, escolas, comércio, centro de saúde e a 1 minuto da autoestrada (Lisboa/Setúbal). Com uma área bruta de 90,38m2, este imóvel é composto por: Cozinha totalmente equipada (placa, forno, exaustor, máquina da loiça, máquina da roupa, esquentador e frigorífico), Sala com uma ampla varanda e ar condicionado, Três quartos um deles com roupeiro e ar condicionado com chão em tacos de madeira, Casa de banho completa equipada com base de duche, Despensa no hall. A nível familiar, este apartamento permite uma excelente mobilidade, uma vez que as escolas básicas do 1º e 2º ciclo encontram-se mesmo em frente ao imóvel e a escola secundária a escassos metros. O imóvel dispõe de ar condicionado, vidro duplos oscilo batentes e gás canalizado. Condomínio organizado de 20€ mensais. Não perca esta excelente oportunidade e agende a sua visita!",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "hasLift": false,
   "priceByArea": 1688.0,
   "detailedType": {
    "typology": "flat"
   },
   "suggestedTexts": {
    "subtitle": "Alto do Seixalinho - Santo André - Verderena, Barreiro",
    "title": "Apartamento na Rua Dom Afonso de Albuquerque, 2"
   },
   "hasPlan": true,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065496",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/9e/67/6e/230316380.jpg",
   "externalReference": "SHA_21V",
   "numPhotos": 12,
   "floor": "1",
   "price": 640000.0,
   "propertyType": "flat",
   "operation": "sale",
   "size": 60.0,
   "rooms": 1,
   "bathrooms": 1,
   "address": "AAA23 António Augusto Aguiar",
   "province": "Lisboa",
   "municipality": "Avenidas Novas",
   "district": "Bairro Azul - Parque Eduardo VII",
   "country": "pt",
   "latitude": 38.7307882,
   "longitude": -9.1515689,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065496/",
   "distance": "1435",
   "description": "Apartamento T1 totalmente novo e mobilado com móveis e acabamentos de alta qualidade.  Este apartamento localizado na emblemática Avenida Antonio Augusto de Aguiar 23 é perfeito para você. Com apenas 3 minutos a pé do El Corte Inglês e da estação de metro São Sebastião, este apartamento oferece uma localização privilegiada no coração de Lisboa. O apartamento é composto por uma sala com cozinha aberta, equipada com eletrodomésticos de marca SMEG, incluindo um frigorífico, forno, placa, máquina de lavar roupa e máquina de lavar loiça. Todas as divisões incluem ar condicionado (quente e frio) para garantir o seu conforto. O prédio conta com segurança / receção 24 horas, 7 dias por semana e possui elevador.  Este apartamento está arrendado com uma yield de 4,1%. A licença de utilização do prédio é 483/UT-CML/2021 de 17 de novembro de 2021.  Não perca esta oportunidade única de adquirir um apartamento totalmente novo e mobilado no coração de Lisboa - entre em contato connosco hoje para marcar uma visita!",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "hasLift": true,
   "priceByArea": 10667.0,
   "detailedType": {
    "typology": "flat"
   },
   "suggestedTexts": {
    "subtitle": "Avenidas Novas, Lisboa",
    "title": "Apartamento em Aaa23 António Augusto Aguiar"
   },
   "hasPlan": false,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065428",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/3e/f3/99/230316090.jpg",
   "numPhotos": 20,
   "floor": "2",
   "price": 140000.0,
   "propertyType": "flat",
   "operation": "sale",
   "size": 60.0,
   "rooms": 2,
   "bathrooms": 1,
   "address": "Rua Florbela Espanca",
   "province": "Lisboa",
   "municipality": "Pontinha e Famões",
   "country": "pt",
   "latitude": 38.7813711,
   "longitude": -9.2062647,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065428/",
   "distance": "8783",
   "description": "A oportunidade de adquirir um apartamento nesta localização revela-se verdadeiramente fascinante, quer esteja a considerar a opção de investir no mercado de arrendamento ou estabelecer um lar permanente. Com uma atraente taxa de rendimento de aproximadamente 5.89%, este investimento promete ser não apenas financeiramente sólido, mas também estrategicamente posicionado. A localização privilegiada do imóvel oferece uma série de benefícios. A acessibilidade de transportes públicos é um ponto forte, facilitando deslocações rápidas e eficientes pela região. A proximidade de uma escola primária é um elemento crucial para famílias, proporcionando comodidade e praticidade para os residentes com crianças em idade escolar. A oferta diversificada de comércio na área é mais uma mais-valia. A conveniência de ter uma variedade de estabelecimentos comerciais nas proximidades, desde mercearias a lojas especializadas, contribui para uma experiência de vida prática e confortável. Esta diversidade comercial não só enriquece o quotidiano, mas também valoriza o investimento a longo prazo, criando um ambiente residencial completo. A proximidade do Metro da Pontinha, a apenas 15 minutos de distância de autocarro ou 6 de carro, é um ponto crucial para quem valoriza a mobilidade e a facilidade de acesso ao centro da cidade. Esta conectividade eficiente abre portas para uma vida dinâmica, permitindo explorar todas as ofertas culturais, comerciais e de lazer que Lisboa tem para oferecer, sem comprometer a comodidade de um ambiente mais calmo e residencial. Se a opção for a aquisição para habitação própria e permanente, a localização estratégica e as facilidades circundantes garantem uma qualidade de vida invejável. A combinação de acessibilidade, oferta educacional e diversidade de comércio faz deste lugar não apenas uma casa, mas um lar completo, enraizado numa comunidade acolhedora e bem conectada. Em resumo, seja para investimento no mercado de arrendamento ou para estabelecer uma residência permanente, a oportunidade de adquirir um apartamento nesta localização oferece uma perspetiva emocionante e vantajosa. A conectividade, a infraestrutura circundante e a promissora taxa de rendimento são elementos que tornam esta propriedade uma escolha atrativa para quem procura investir no setor imobiliário ou estabelecer raízes num ambiente acolhedor e conveniente.",
   "hasVideo": true,
   "status": "good",
   "newDevelopment": false,
   "hasLift": true,
   "priceByArea": 2333.0,
   "detailedType": {
    "typology": "flat"
   },
   "suggestedTexts": {
    "subtitle": "Pontinha e Famões, Odivelas",
    "title": "Apartamento na Rua Florbela Espanca"
   },
   "hasPlan": true,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065181",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/41/76/56/230309261.jpg",
   "externalReference": "BPT1-500",
   "numPhotos": 16,
   "floor": "1",
   "price": 185000.0,
   "propertyType": "flat",
   "operation": "sale",
   "size": 77.0,
   "rooms": 1,
   "bathrooms": 1,
   "address": "Sines",
   "province": "Setúbal",
   "municipality": "Sines",
   "country": "pt",
   "latitude": 37.9553275,
   "longitude": -8.8640781,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065181/",
   "distance": "88562",
   "description": "Apartamento localizado na melhor zona da cidade de Sines. Este imóvel é um T0 transformado em T1, no entanto tem área de T1. Recentemente pintado, cozinha com bancada nova e sofreu algumas intervenções de forma a ser vendido praticamente como novo. Tem hall de entrada, casa de banho completa, cozinha completamente equipada(inclusive com máquina de secar roupa), despensa, sala para refeições e sala de estar, quarto com dois roupeiros. Possui também um lugar de estacionamento na melhor garagem da cidade e uma arrecadação individual. Aquecimento central em funcionamento e pré-instalação de ar condicionado. De salientar que o apartamento é muito soalheiro. Pavimento das cozinha e da casa de banho em mosaico cerâmico, restante pavimento em madeira tropical. Imóvel sem margem de negociação. Área bruta privativa: 58,55 m2 Área bruta dependente: 19,09 m2 Condomínio: 26,71 euros.",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "hasLift": true,
   "parkingSpace": {
    "hasParkingSpace": true,
    "isParkingSpaceIncludedInPrice": true
   },
   "priceByArea": 2403.0,
   "detailedType": {
    "typology": "flat"
   },
   "suggestedTexts": {
    "subtitle": "Sines",
    "title": "Apartamento"
   },
   "hasPlan": false,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065451",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/a0/31/77/230317872.jpg",
   "externalReference": "109033",
   "numPhotos": 24,
   "price": 535000.0,
   "propertyType": "chalet",
   "operation": "sale",
   "size": 166.0,
   "rooms": 3,
   "bathrooms": 3,
   "address": "Lourel",
   "province": "Lisboa",
   "municipality": "Sintra",
   "district": "Lourel",
   "country": "pt",
   "latitude": 38.811965,
   "longitude": -9.3729042,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065451/",
   "distance": "22574",
   "description": "Moradia geminada de arquitetura contemporânea, de construção recente, em Lourel, reconhecida pelo seu enquadramento urbanístico, a 3km do centro da mística Sintra. Acesso à autoestrada A16, a 30Km do aeroporto de Lisboa e 17km de Cascais.  Nas proximidades, além de todas as atrações e palácios de Sintra, património mundial, encontra escolas internacionais, campos de golfe, o parque natural Sintra/Cascais e suas praias, hospitais, centros comerciais, etc. Localizada numa rua sem saída, recatada e sossegada, junto ao espaço florestal que envolve a Quinta da Ribafria. Esta moradia é uma excelente opção para quem procura uma casa de qualidade superior, com áreas generosas, muita luminosidade, conforto e nível de equipamento.  Está distribuída por 2 pisos.  No exterior do piso 0, encontra um pequeno jardim com uma piscina montada e espaço para churrasco. No interior, encontramos a garagem/lavandaria, e zona social, com sala, cozinha, arrecadação e pequena instalação sanitária. No piso 1, o espaçoso hall, faz a distribuição perfeita para a suíte, com closet e wc, e outros 2 quartos, com respetiva wc de apoio. Equipamento: Ar condicionado, caixilharia em alumínio com rutura térmica, vidros duplos, estores elétricos, cozinha moderna equipada com eletrodomésticos de marcas reconhecidas, painéis solares para aquecimento de água, aspiração central, torneiras elétricas de sensor nas wcs, tetos falsos com leds embutidos, e pavimento vinílico. Marque a sua visita, para conhecer melhor as vantagens deste imóvel. No final, ajudamo-lo a encontrar a melhor solução de financiamento, e oferecemos o custo da escritura. Áreas: Garagem 19,9 m2 Piso 0 Hall 9,55 m2 Sala 25,55 m2 Cozinha 13,30 m2 WC 2,15 m2 Dispensa 1,55 m2 Piso 1 Hall 4,15 m2 Quarto 12,05 m2 Quarto 13,90 m2 Suite + closet 15,65 m2 WC 5,3 m2 WC 3,95 m2 ref: 109033.",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "parkingSpace": {
    "hasParkingSpace": true,
    "isParkingSpaceIncludedInPrice": true
   },
   "priceByArea": 3223.0,
   "detailedType": {
    "typology": "chalet"
   },
   "suggestedTexts": {
    "subtitle": "Sintra",
    "title": "Moradia"
   },
   "hasPlan": false,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065450",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/e3/ed/20/230317858.jpg",
   "externalReference": "108949",
   "numPhotos": 14,
   "floor": "1",
   "price": 745000.0,
   "propertyType": "flat",
   "operation": "sale",
   "size": 142.0,
   "rooms": 2,
   "bathrooms": 1,
   "address": "Prazeres",
   "province": "Lisboa",
   "municipality": "Estrela",
   "district": "Prazeres",
   "country": "pt",
   "latitude": 38.7101697,
   "longitude": -9.1684052,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065450/",
   "distance": "2832",
   "description": "Descubra o requinte e a exclusividade no coração do centro histórico de Lisboa. Essa residencia é um projeto de reabilitação que redefine a experiência de viver na cidade, combinando qualidade, conforto e distinção em cada detalhe. Localização Privilegiada: Situado no prestigiado bairro da Estrela, ela destaca-se como um edifício emblemático com 45 apartamentos. Desfrute da proximidade à zona ribeirinha e a deslumbrantes áreas verdes, proporcionando um estilo de vida citadino equilibrado. Conexão Perfeita: Os moradores podem contar com múltiplos pontos de transporte público, serviços, opções de restauração e comércio. Além disso, a inauguração de uma nova estação de metro em 2025 reforçará ainda mais a acessibilidade a toda a cidade. Vistas Panorâmicas: Deslumbre-se com vistas panorâmicas sobre Lisboa e o majestoso Rio Tejo. O condomínio oferece acesso exclusivo a um elegante rooftop, onde uma piscina e uma área de lazer aguardam para tornar seus momentos únicos. Características dos Apartamentos: Apartamentos T1, T2, T2+1 e T3 com design harmonioso e funcional. Acabamentos, revestimentos e materiais de alta qualidade. Ar condicionado para o seu conforto em todas as estações. Cozinhas totalmente equipadas para uma experiência culinária de excelência. Chão em madeira e janelas de vidros duplos para um ambiente aconchegante e tranquilo. Seja parte desta experiência única de viver onde a tradição encontra o luxo contemporâneo. Agende já a sua visita e descubra o seu refúgio perfeito no coração de Lisboa! Importante: se você não estiver fisicamente presente, os canais digitais permitem-me continuar a assegurar um acompanhamento próximo a todos os meus clientes. Continuo 100% disponível, por telefone ou por e-mail, para lhe prestar qualquer esclarecimento adicional sobre este imóvel e programar uma visita física, respeitando as condições de segurança necessárias. Não hesite em vir fazer uma visita para se apaixonar por este ótimo projeto. IAD é uma agência imobiliária digital com base no profissionalismo e na transparência, trabalho na parceria de comissões 50/50 com todas as agências com um número AMI. Como consultor imobiliário independente, tenho autonomia para organizar a minha agenda, o que me permite conhecê-lo e oferecer-lhe o melhor serviço qualquer que seja o sítio em que se encontra, garantindo um suporte personalizado em todas as etapas do seu projeto. Contacta-me em Português, Francês ou Inglês. ref: 108949.",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "priceByArea": 5246.0,
   "detailedType": {
    "typology": "flat"
   },
   "suggestedTexts": {
    "subtitle": "Estrela, Lisboa",
    "title": "Apartamento"
   },
   "hasPlan": true,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065414",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/53/eb/a3/230315243.jpg",
   "externalReference": "A/01437",
   "numPhotos": 10,
   "price": 235000.0,
   "propertyType": "flat",
   "operation": "sale",
   "size": 88.0,
   "rooms": 3,
   "bathrooms": 2,
   "address": "Monte Abraão",
   "province": "Lisboa",
   "municipality": "Massamá e Monte Abraão",
   "district": "Monte Abraão",
   "country": "pt",
   "latitude": 38.7610152,
   "longitude": -9.2649973,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065414/",
   "distance": "11718",
   "description": "OFERTA ATO ÚNICO ESCRITURA E REGISTOS! Monte Abraão. Apartamento T3 totalmente remodelado, cozinha semi equipada, Suíte, pavimento em cerâmica, na cozinha e no wc, - Pavimento flutuante nas restantes divisões; quarto com Roupeiro embutido. Soalheiro nascente/poente. Andar alto. Vistas desafogadas. Prédio 2 elevadores em bom estado de conservação. Condomínio organizado. Fácil estacionamento.",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "hasLift": true,
   "priceByArea": 2670.0,
   "detailedType": {
    "typology": "flat"
   },
   "suggestedTexts": {
    "subtitle": "Massamá e Monte Abraão, Sintra",
    "title": "Apartamento"
   },
   "hasPlan": false,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065411",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/cf/21/a1/230314820.jpg",
   "externalReference": "V23331",
   "numPhotos": 33,
   "price": 375000.0,
   "propertyType": "chalet",
   "operation": "sale",
   "size": 95.45,
   "rooms": 3,
   "bathrooms": 1,
   "address": "Centro da Vila",
   "province": "Lisboa",
   "municipality": "Ericeira",
   "district": "Centro da Vila",
   "country": "pt",
   "latitude": 38.9602671,
   "longitude": -9.4160733,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065411/",
   "distance": "35718",
   "description": "*Cond **NG_MC em prop** Moradia T3+1 junto à Ericeira para remodelação em lote de 600m2. Ótima oportunidade de investimento para remodelar ou vender. Moradia T3+1 junto à Ericeira para remodelação em lote de 600m2. Ótima oportunidade de investimento para remodelar ou vender. Moradia num lote de 620m2 com furo, árvores de fruto, jardim e espaço para piscina. A mordia é composta por cozinha, casa de banho, sala, 3 quartos, sótão e garagem com adega* *O sótão, a garagem e a adega não constam na licença de utilização. Equipamentos:  Furo, jardim, muro * Toda a informação disponível não dispensa a confirmação por parte da mediadora bem como a consulta da documentação do imóvel. *.",
   "hasVideo": false,
   "status": "renew",
   "newDevelopment": false,
   "priceByArea": 3929.0,
   "detailedType": {
    "typology": "chalet"
   },
   "suggestedTexts": {
    "subtitle": "Ericeira, Mafra",
    "title": "Moradia"
   },
   "hasPlan": false,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065402",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/d0/18/11/230314725.jpg",
   "externalReference": "7109R20",
   "numPhotos": 52,
   "floor": "3",
   "price": 430000.0,
   "propertyType": "flat",
   "operation": "sale",
   "size": 249.0,
   "rooms": 3,
   "bathrooms": 2,
   "address": "Ramada e Caneças",
   "province": "Lisboa",
   "municipality": "Ramada e Caneças",
   "country": "pt",
   "latitude": 38.8005731,
   "longitude": -9.1958896,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065402/",
   "distance": "10014",
   "description": "Refª 7109 EXCLUSIVO BLYSS REAL ESTATE Venha conhecer este fantástico apartamento seminovo (2021), com três frentes solares, distribuído em dois pisos, duas varandas (8m2 e 16m2), com churrasqueira, Box com 18 m2 e parqueamento para 1 viatura com 15 m2. Localizado próximo da Urbanização Colinas do Cruzeiro, assim como dos principais acessos à cidade de Lisboa e outros locais. CARACTERISTICAS; PISO PRINCIPAL - Cozinha totalmente equipada (Bosh) com cerca de 14 m2; - Varanda de acesso pela cozinha com churrasqueira e vista desafogada; - Sala com 30 m2 com acesso a varanda; - Quarto com 14 m2 com roupeiro e acesso a varanda; - Suíte com 17 m2 com dois roupeiros, acesso a varanda; - Casa de banho da suíte, poliban, janela e área de 4 m2; - Casa de banho serviço, poliban, janela e área de 6 m2; PISO SUPERIOR (Total de 85 m2) - Escritório ou quarto com 18 m2; - Lavandaria com 16 m2; - Àrea em Open space com cerca de 50m2; GARAGEM - Box com cerca de 18 m2; - 1 Parqueamento de 15m2 Equipamentos: - Ar condicionado; - Painéis solares; - Aspiração central; - Estores eléctricos e térmicos; - Janelas oscilobatentes com vidro duplos; - Vídeo porteiro; - Alarme - Som ambiente; - Pavimento flutuante tipo AC4 (com insonorização acústica) Contacte-nos para visitar este fantástico imóvel. * Todas as informações apresentadas não têm qualquer carácter vinculativo, não dispensa a confirmação por parte da mediadora, bem como a consulta da documentação do imóvel *.",
   "hasVideo": false,
   "status": "good",
   "newDevelopment": false,
   "hasLift": true,
   "priceByArea": 1727.0,
   "detailedType": {
    "typology": "flat"
   },
   "suggestedTexts": {
    "subtitle": "Ramada e Caneças, Odivelas",
    "title": "Apartamento"
   },
   "hasPlan": true,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065410",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/2a/77/97/230314697.jpg",
   "externalReference": "V23332",
   "numPhotos": 28,
   "price": 268000.0,
   "propertyType": "chalet",
   "operation": "sale",
   "size": 9296.0,
   "rooms": 2,
   "bathrooms": 1,
   "address": "Mafra",
   "province": "Lisboa",
   "municipality": "Mafra",
   "country": "pt",
   "latitude": 38.9533064,
   "longitude": -9.3279198,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065410/",
   "distance": "30462",
   "description": "*Cond Moradia isolada com 2 quartos + anexos* em terreno de 1Ha. Excelente oportunidade para investir e aproveitar a parcela dentro da mancha Urbana do PDM com cerca de 1500m2* em mancha urbana. Moradia isolada com 2 quartos + anexos em terreno de 1Ha. Excelente oportunidade para investir e aproveitar a parcela dentro da mancha Urbana do PDM com cerca de 1500m2* em mancha urbana. Esta propriedade encontra-se a 2 minutos do centro da vila de Mafra, tem uma ótima exposição solar e uma vista de campo completamente A Moradia é composta por 1 cozinha, 2 quartos, 1 sala e um wc. Anexo à casa existe uma área de arrumos, uma adega e te lheiros que servem de estábulo. Também existe um poço. **A propriedade é composta por uma parte urbana de 390m2 onde se encontram a casa e anexos, e uma parte rustica com 10043m2 com cerca de 1100m2 de área em zona urbana segundo o PDM. *Os anexos não contam na documentação. Equipamentos:  Anexos com Cerca de 30m2 - Estábulo - Adega - Poço * Toda a informação disponível não dispensa a confirmação por parte da mediadora bem como a consulta da documentação do imóvel. *.",
   "hasVideo": false,
   "status": "renew",
   "newDevelopment": false,
   "priceByArea": 29.0,
   "detailedType": {
    "typology": "chalet"
   },
   "suggestedTexts": {
    "subtitle": "Mafra",
    "title": "Moradia"
   },
   "hasPlan": false,
   "has3DTour": false,
   "has360": false,
   "hasStaging": false,
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  },
  {
   "propertyCode": "33065401",
   "thumbnail": "https://img3.idealista.pt/blur/WEB_LISTING/0/id.pro.pt.image.master/1d/f9/a5/230314640.jpg",
   "externalReference": "BS122303",
   "numPhotos": 30,
   "floor": "3",
   "price": 225000.0,
   "propertyType": "flat",
   "operation": "sale",
   "size": 92.0,
   "rooms": 2,
   "bathrooms": 1,
   "address": "Avenida Santa Marta",
   "province": "Lisboa",
   "municipality": "Casal de Cambra",
   "country": "pt",
   "latitude": 38.798167,
   "longitude": -9.2337693,
   "showAddress": false,
   "url": "https://www.idealista.pt/imovel/33065401/",
   "distance": "11772",
   "description": "T2 Casal de Cambra com 3 varandas com arrecadação e parqueamento  Apartamento em excelente estado de conservação, vendido semi-mobilado. T2 com boas áreas, com a seguinte disposição: - Espaçoso hall de entrada (9m2) - Sala com excelente vista desafogada com recuperador de calor com acesso a varanda (22,60m2); - Cozinha equipada com varanda 12m2; - Despensa; - 2 Quartos com armários encastrados, 1 deles com acesso a outra varanda (17m2 e 13,15m2); - 1 espaçoso wc com banheira (4,6m2) - Arrecadação com 19m2; - Parqueamento para 1 viatura. Prédio de 2002. 3º andar sem elevador. Excelente estado de conservação. Vendido com parte da mobília (negociação possível). Apartamento muito luminoso. Boa localização, com espaços comerciais a 300m, escolas, zonas verdes, transportes públicos. Mercado a escassos metros de distância. Excelentes acessos. A escassos 10 minutos do centro comercial UBBO, da Autoestrada A9.  Não perca a SUA CASA! Marque a sua visita! Refª BS122303 Financiamento Bancário: A Habita é parceira de várias entidades financeiras possibilitando a todos os seus clientes simulações gratuitas de Crédito à Habitação. Localização: Casal de Cambra é uma freguesia portuguesa do município de Sintra. A povoação de Casal de Cambra, sede da freguesia, foi elevada a vila em 12 de junho de 2009. Casal de Cambra foi, em séculos passados 'grandes terras de pão', e os seus terrenos eram cobertos por extensas searas. Desde o século XV, a Quinta do Casal, como era denominada nessa época, pertencia à Infanta D. Beatriz, mãe de D. Manuel I. Estas terras entraram posteriormente no século XVI na casa da Rainha e tomaram o nome de Câmara, destinando-se o rendimento dessas terras ao sustento da casa da Rainha. Surgiu devido à crise de habitação existente na altura e à pressão exercida pela grande cidade de Lisboa que ia empurrando as pessoas para a periferia. Era uma propriedade rústica destinada à exploração agrícola e pecuária. O bairro foi-se expandindo com a construção de carácter familiar e não com o aspecto comercial. A recuperação do bairro iniciou-se em 1973, havendo em 1979 um trabalho intensivo para evitar o aparecimento de novas construções, enquanto o projecto se encontrava em elaboração. Em 1982 ini.",
   "hasVideo": true,
   "status": "good",
   "newDevelopment": false,
   "hasLift": false,
   "priceByArea": 2446.0,
   "detailedType": {
    "typology": "flat"
   },
   "suggestedTexts": {
    "subtitle": "Casal de Cambra, Sintra",
    "title": "Apartamento na Avenida Santa Marta"
   },
   "hasPlan": true,
   "has3DTour": false,
   "has360": true,
   "hasStaging": false,
   "highlight": {
    "groupDescription": "Destaque"
   },
   "topNewDevelopment": false,
   "topPlus": false,
   "superTopHighlight": false
  }
 ],
 "total": 56376,
 "totalPages": 1128,
 "actualPage": 1,
 "itemsPerPage": 50,
 "numPaginations": 0,
 "summary": [
  "Comprar",
  "Casas",
  "Pena, Arroios",
  "Todos os preços",
  "Todos os tamanhos"
 ],
 "alertName": "Casas em Pena, Arroios",
 "totalAppliedFilters": 0,
 "upperRangePosition": 50,
 "lowerRangePosition": 0,
 "paginable": true
}